import 'dart:math';

import 'package:final_project/model/cardTarots22.dart';
import 'package:flip_card/flip_card.dart';
import 'package:flutter/material.dart';
import 'package:animated_flip_card/animated_flip_card.dart';

import '../../model/cardTarotsCoin.dart';
import '../../model/cardTarotsWood.dart';

class tarotCard extends StatefulWidget {
  final int position;

  const tarotCard({Key? key, required this.position}) : super(key: key);

  @override
  _tarotCardState createState() => _tarotCardState();

}

class _tarotCardState extends State<tarotCard> {
  late int _position;
  void initState() {
    super.initState();
    _position = widget.position;
    print('position $_position');
  }

  final List<cardTarotsCoin> cardsCoin = [
    cardTarotsCoin(
      meaning:
      'จะได้รับการเริ่มต้นใหม่ที่มีโอกาสที่ดีในอนาคต ด้รับโอกาสใหม่ๆที่เป็นโอกาสที่สามารถพัฒนาให้มั่นคง ลงทุนอะไรก็จะได้รับผลตอบแทน',
      love:
      'ความสัมพันธ์อยู่ในระยะเริ่มต้นที่ไปในทิศทางที่ดีและถูกต้อง ถึงจะยังไม่ใช่จุดที่จะลงตัวเป็นแฟนกัน แต่เรียกได้ว่าเป็นการเริ่มต้นที่ดี มีโอกาสพัฒนาไปในทางที่ดี ในอีกมุมมองคือคนที่เข้ามาหาเรา อาจจะพร้อมที่จะ ช่วยเหลือเราในด้านการเงิน',
      image: '1.png',
      name: 'ACE OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'การจัดการเรื่องค่าใช้จ่าย การหมุนเงิน การจ่ายหนี้ ยังสมดุล มีเงินใช้หมุนเวียนได้เรื่อยๆไม่ติดขัด',
      love:
      'คนโสด ต้องจัดการความสัมพันธ์ให้ราบรื่นทุกคน หรืออาจหมายถึงว่า เรามีสิ่งสำคัญอื่นๆที่เราต้องให้เวลาและความสำคัญ เช่น การให้เวลากับเพื่อน ครอบครัว งาน งานอดิเรก ส่วนคนมีคู่ ต้องพยายามจัดการให้เวลากับความรัก การงาน เพื่อน ครอบครัว ที่สิ่งที่เราคิดว่าสำคัญ ให้ลงตัว สมดุล ไม่ทำให้อะไรขาด หรือเสียไป',
      image: '2.png',
      name: 'TWO OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ไพ่นี้หมายถึง การส่งสิ่งที่เราสร้างขึ้นมาออกไป เช่น การส่งงาน ส่งของ ส่งความรัก การรอผลลัพธ์ที่ส่งออกไปกลับมา โดยที่ก็ไม่รู้ว่าผลลัพธ์จะดีหรือไม่',
      love:
      'มีการริเริ่มที่จะวางแผน อนาคตที่มั่งคั่ง การคุยหารือ กันอย่างจริงจังในอนาคต เช่น เรื่องการเงิน การทำงาน การมีลูก การแบ่งหน้าที่ เป็นต้น หรือบางทีอาจจะคุยปรึกษาหารือกันว่าจะเอายังไงกับความสัมพันธ์นี้ ถ้ามันไม่ดีเราจะปรับแก้ไขอย่างไร',
      image: '3.png',
      name: 'THREE OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ไพ่ของไม้ทั้งสี่ไม้เปรียบเสมือนความมั่นคง บ้านที่สร้างได้สำเร็จ และมีชายหญิงคู่หนึ่งที่เฉลิมฉลองกัน ในงานเลี้ยงที่คนมาร่วมงานมากมาย เป็นดั่งงานแต่งงานที่มีความสุข ไพ่ใบนี้จึงหมายถึง การเฉลิมฉลอง งานแต่งงาน ความรัก เพื่อน ครอบครัว',
      love:
      'โดยปกติเป็นไพ่ที่ดีในด้านความรัก หมายถึงความรักที่สุกงอม มีการเฉลิมฉลอง อบอุ่น รวมถึความรักนี้ ในมุมมองครอบครัว เพื่อน ก็ยอมรับ มีความสุขกันอย่างดี',
      image: '4.png',
      name: 'FOUR OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'เด็ก 5 คน กำลังทำการต่อเติมไม้ที่ถือไว้ ทุกคนพยายามที่จะปักไม้ของตัวเองลงและประกอบเข้าด้วยกันให้ลงตัว แต่ก็ยังยุ่งเหยิงเพราะแต่ละคนไม่เข้าใจกัน ไพ่ใบนี้จึงหมายถึง การถกเถียง การประชุม วางแผน ความขัดแย้ง แข่งขัน',
      love:
      'หมายถึงการขัดแย้งในแนวคิด หรืออะไรต่างๆ ที่จะวางแผนด้วยกัน มีความขัดแย้งกันไม่ลงตัว ต่างฝ่ายต่างไม่ยอมกัน ก็เลยอาจจะทะเลาะกันบ้าง',
      image: '5.png',
      name: 'FIVE  OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ชายนายทหารผู้ได้รับชัยชนะ เดินทางกลับมายังเมือง โดยมีผู้คนมาร่วมสรรเสริญและแสดงความยินดีอยู่รอบข้าง ไพ่ใบนี้จึงหมายถึง การมีความคืบหน้า การได้รับชัยชนะ การจบปัญหาด้วยดี มีความมั่นใจ เชื่อมั่นในตัวเอง',
      love:
      'ความรักกับไพ่ใบนี้นั้น ก็เรียกได้ว่าเป็นความรักที่ดี ความรักมีความก้าวหน้า ความสัมพันธ์มีความเดินหน้าไปในทิศทางที่ดีขึ้น ถ้าหากความสัมพันธ์มีปัญหามาก่อนก็จะได้รับการแก้ไขไปอย่างดี',
      image: '6.png',
      name: 'SIX OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ความหมายไพ่ใบนี้จึงหมายถึงการ รักษาตำแหน่ง รักษาสิ่งที่เราคิดว่าถูก รักษาสิทธิ์ที่เป็นของเรา ต่อสู้กับปัญหาต่างๆที่เข้ามา จากสิ่งที่เราอาจจะยังไม่รู้ชัดว่าคืออะไร บางทีเราอาจจะคิดมากไปเองหรือกังวลเกินไป',
      love:
      'ความสัมพันธ์เหมือนมีอุปสรรคเข้ามา หรือแม้แต่ปัญหาภายใน เรื่องการที่อีกฝ่ายทำร้ายจิตใจคุณ ให้คุณต้องต่อสู้ฝ่าฟันเพื่อรักษาความสัมพันธ์ให้คงอยู่ต่อไป และอาจหมายถึงการต่อสู้เพื่อรักษาตัวตนของตัวเองในความสัมพันธ์ได้ด้วย',
      image: '7.png',
      name: 'SEVEN OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ไพ่ใบนี้แปลได้ว่า จะมีการเปลี่ยนแปลง มีเรื่องเข้ามากระทันหัน รวดเร็ว จนคุณตั้งตัวไม่ทัน ส่วนใหญ่จะแปลไปในทางที่ดี',
      love:
      'ความสัมพันธ์เป็นไปอย่างรวดเร็ว ความรักพัฒนาไปอย่างรวดเร็ว มีความคืบหน้า มีเรื่องเซอร์ไพรซ์ หากเป็นโสดก็มีความเป็นไปได้ถึงการที่มีคนเข้ามาทำให้ชอบ ทำให้รักอย่างรวดเร็ว ไม่ทันตั้งตัว',
      image: '8.png',
      name: 'EIGHT OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ทุกครั้งที่ผิดพลาดล้มเหลว ชายในไพ่ใบนี้จะได้รับบาดแผลแต่ก็ทำให้เค้าได้ประสบการณ์ความรู้ ไพ่ใบนี้จึงแปลได้ถึง การทำงานที่มีประสบการณ์ เพราะที่ผ่านมาอาจจะหนัก และล้มเหลวมาแล้ว จนทำให้รู้ถึงปัญหาและวิธีแก้ไขได้',
      love:
      'ความสัมพันธ์ที่เรียกได้ว่า เจ็บมาเยอะ จนทำให้มีประสบการณ์มามาก และทำให้มีรู้วิธีในการแก้ไขปัญหาความสัมพันธ์ต่างๆ ที่เข้ามา ได้อย่างดี ไพ่ใบนี้ในมุมมองหลักๆจึงเป็นความหมายที่ดี ที่สามารถดำเนินความสัมพันธ์ต่อไปได้ เพราะเรามีประสบการณ์ที่จะจัดการ',
      image: '9.png',
      name: 'NINE OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ไพ่ใบนี้แปลได้เลยว่าหมายถึง งานที่ครบ งานที่เต็ม ความปรารถนาความต้องการที่เต็มเปี่ยม แต่จาก ไพ่จะเห็นว่ามันยังไม่ถึงจุดสิ้นสุด ถึงแม้จะใกล้แล้วก็ตาม ดังนั้นสิ่งที่เราทำคือการ แบกรับ มันไว้ เพื่อให้ไปถึงจุดหมายที่เราตั้งเป้าไว้ อาจหมายถึงงานที่หนัก ภาระในจิตใจที่หนักอึ้ง แต่เราก็ยังคงเดินหน้าต่อไปยังเป้าหมายได้',
      love:
      'ถึงไพ่หมายเลข 10 จะหมายถึงการครบ จบสมบูรณ์ แต่ไพ่ใบนี้นั้นยังไม่ค่อยสมบูรณ์เท่าไหร่ ไพ่ใบนี้จะหมายถึงความสัมพันธ์ที่หนักอึ้ง อาจเป็นภาระด้านอื่นๆ เช่น เรื่องงาน เงิน ครอบครัว ที่อาจไม่เห็นด้วย',
      image: '10.png',
      name: 'TEN OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ไพ่ใบนี้จึงหมายถึงการเปลี่ยนแปลงหรือการเริ่มพัฒนา เริ่มต้น สิ่งใหม่ๆที่มีแรงผลักดัน มีแรงบันดาลใจ เช่น การผจญภัย การทำงานใหม่ทีท้าทายขึ้น และเราก็พร้อมที่จะลุยไป',
      love:
      'ความรักความสัมพันธ์ของไพ่ใบนี้ มักแปลถึงการเริ่มต้น การเปลี่ยนแปลง ความต้องการในการพัฒนาความสัมพันธ์ เป็นการเริ่มความรักที่ค่อนข้างจะรุนแรง หรือวัยรุ่นซะหน่อย คือมีความรักที่มาก เป็นความรักที่เหมือนการผจญภัย มีเรื่องน่าตื่นเต้นหวือหวาตลอดเวลา',
      image: '11.png',
      name: 'PAGE OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ความหมายคือ การเดินหน้า ลุยทำในสิ่งที่ใจต้องการ จนบางทีอาจจะเป็นพวกรีบร้อน ทำอะไรโดยไม่คิดให้รอบคอบได้ อาจจะหมายถึงการที่ตะลุยทำงานอย่างมุ่งมั่น ตั้งใจ ด้วยพลังงานที่เปี่ยมล้น แต่ต้องระวังเรื่องความสะเพร่าด้วยเช่นกัน',
      love:
      'ไพ่ใบนี้หมายถึงความสัมพันธ์ที่เดินหน้าไปด้วยความรวดเร็ว ไปเร็วด้วยความต้องการ มีพลังพร้อมจะฝ่าฟันอุปสรรค มองในแง่ดีก็ถือว่าดี แต่เรื่องความรัก บางทีก็อาจจะขาดความรอบคอบไปซะหน่อย จนอาจจะทำให้ความสัมพันธ์ไม่ยืดยาวหรือยั่งยืนนัก',
      image: '12.png',
      name: 'KNIGHT OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'คนที่ได้ไพ่ใบนี้ (โดยเฉพาะผู้หญิง) เป็นคนที่มีความมั่นใจ สดใส มีความมุ่งมั่นสูง มีความฝัน ชอบปาร์ตี้สังสรรค์และทำงานเก่ง จู้จี้จุกจิก ถ้าหากได้ไพ่ใบนี้ขึ้นมา ก็อาจจะหมายถึงการที่จะได้พบ ผู้หญิงที่มีลักษณะแบบที่กล่าวมา เข้ามาในสถานการณ์ของคุณ',
      love:
      'ไพ่ราชินีไม้เป็นลักษณะของผู้หญิงที่มีสเน่ห์ มีความมุ่งมั่น ในการทำงาน ความฝัน และมีความเฟรนลี่ เพื่อนเยอะ ชอบสังคม ทำให้ดึงดูดคนเข้ามามากมาย แต่ถ้าโสดอยู่ ก็จะตอบได้ว่าผู้หญิงคนนี้ยังไม่คิดที่จะลงเอยกับใคร เพราะเธอค่อนข้างจะสามารถอยู่ตัวคนเดียวได้ พึ่งพาตัวเองได้',
      image: '13.png',
      name: 'QUEEN OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'คนที่ได้ไพ่ใบนี้จึงเป็นคนที่ค่อนข้างกระตือรือร้น มีแรงผลักดัน เพื่อให้ได้ในสิ่งที่ตัวเองต้องการ และเนื่องจากมีความเป็นผู้ใหญ่จากการเป็นราชา ไพ่ไม้เน้นไปที่เรื่องงาน ถ้าได้ใบนี้ก็เรียกได้ว่า อาจจะได้ทำงานเป็นหัวหน้า หรือเป็นคนที่เก่งในเรื่องงาน เป็นผู้นำในการทำงานได้อย่างดี',
      love:
      'ไพ่ใบนี้อาจจะเรียกได้ว่าเป็นความสัมพันธ์ที่มีพลังงาน มีแรงผลักดันในการพากันไปในเป้าหมายของความรักที่ต้องการได้  นอกจากนี้ยังหมายถึงความรักที่ใช้ความปรารถนาเป็นตัวนำพาไปได้ด้วย',
      image: '14.png',
      name: 'KING OF PENTACLES',
    ),


  ];
  final List<cardTarotsWood> cardsWood = [
    cardTarotsWood(
      meaning:
      'หมายถึงการเริ่มต้นใหม่ การได้รับโอกาสด้านการงานใหม่ มีสิ่งใหม่ๆเข้ามา ไพ่ใบนี้จึงเหมือนจุดเริ่มต้นของสิ่งที่ร้อนแรง การงาน ความต้องการใหม่ๆ',
      love:
      'ในด้านความรัก ใบนี้ค่อนข้างจะดีทีเดียว หมายถึงการเริ่มต้นใหม่ ความรู้สึกใหม่ๆ ที่ทำให้เรารู้สึกดี หากถามว่าอีกฝ่ายรู้สึกยังไงแล้วไพ่ใบนี้แทนเค้า หรือไพ่ใบนี้ขึ้นแทนตัวเราในสถานการณ์ก็หมายถึงอารมณ์ที่รุนแรง เต็มไปด้วยพลัง ความชอบ ความรัก ที่พร้อมจะพุ่งชน พุ่งจีบ ทีเดียว  ',
      image: '1.png',
      name: 'ACE OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ไพ่ใบนี้หมายถึง การวางแผนอนาคต การมองถึงอนาคต ถึงจุดที่ต้องตัดสินใจเลือกเดิน',
      love:
      'ในมุมมองความรัก ไพ่ใบนี้ก็หมายถึง ความรักที่กำลังไปในทางที่ดี มีโอกาสในการพัฒนาที่ดี ไพ่ใบนี้นอกจากกรณีดังกล่าว ก็ยังมีกรณีที่หมายถึงการที่หมายถึงว่าเรายังไม่คิดที่จะมองใคร เรายังมองไปยังโลกกว้าง มองไปยังอนาคตที่ยังมาไม่ถึง คิดว่าน่าจะมีโอกาสในความรักที่ดีกว่านี้',
      image: '2.png',
      name: 'TWO OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ไพ่นี้หมายถึง การส่งสิ่งที่เราสร้างขึ้นมาออกไป เช่น การส่งงาน ส่งของ ส่งความรัก การรอผลลัพธ์ที่ส่งออกไปกลับมา โดยที่ก็ไม่รู้ว่าผลลัพธ์จะดีหรือไม่',
      love:
      'ในด้านความรัก ไพ่ใบนี้ก็ความหมายไม่ต่างกัน ในความสัมพันธ์ที่เป็นคนรักกันแล้ว ก็อาจจะอยู่ในช่วงห่างไกลกันต้องมีคนที่รอคอยคนนึงเสมอ',
      image: '3.png',
      name: 'THREE OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ไพ่ของไม้ทั้งสี่ไม้เปรียบเสมือนความมั่นคง บ้านที่สร้างได้สำเร็จ และมีชายหญิงคู่หนึ่งที่เฉลิมฉลองกัน ในงานเลี้ยงที่คนมาร่วมงานมากมาย เป็นดั่งงานแต่งงานที่มีความสุข ไพ่ใบนี้จึงหมายถึง การเฉลิมฉลอง งานแต่งงาน ความรัก เพื่อน ครอบครัว',
      love:
      'โดยปกติเป็นไพ่ที่ดีในด้านความรัก หมายถึงความรักที่สุกงอม มีการเฉลิมฉลอง อบอุ่น รวมถึงความรักนี้ ในมุมมองครอบครัว เพื่อน ก็ยอมรับ มีความสุขกันอย่างดี',
      image: '4.png',
      name: 'FOUR OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'เด็ก 5 คน กำลังทำการต่อเติมไม้ที่ถือไว้ ทุกคนพยายามที่จะปักไม้ของตัวเองลงและประกอบเข้าด้วยกันให้ลงตัว แต่ก็ยังยุ่งเหยิงเพราะแต่ละคนไม่เข้าใจกัน ไพ่ใบนี้จึงหมายถึง การถกเถียง การประชุม วางแผน ความขัดแย้ง แข่งขัน',
      love:
      'หมายถึงการขัดแย้งในแนวคิด หรืออะไรต่างๆ ที่จะวางแผนด้วยกัน มีความขัดแย้งกันไม่ลงตัว ต่างฝ่ายต่างไม่ยอมกัน ก็เลยอาจจะทะเลาะกันบ้าง',
      image: '5.png',
      name: 'FIVE  OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ชายนายทหารผู้ได้รับชัยชนะ เดินทางกลับมายังเมือง โดยมีผู้คนมาร่วมสรรเสริญและแสดงความยินดีอยู่รอบข้าง ไพ่ใบนี้จึงหมายถึง การมีความคืบหน้า การได้รับชัยชนะ การจบปัญหาด้วยดี มีความมั่นใจ เชื่อมั่นในตัวเอง',
      love:
      'ความรักกับไพ่ใบนี้นั้น ก็เรียกได้ว่าเป็นความรักที่ดี ความรักมีความก้าวหน้า ความสัมพันธ์มีความเดินหน้าไปในทิศทางที่ดีขึ้น ถ้าหากความสัมพันธ์มีปัญหามาก่อนก็จะได้รับการแก้ไขไปอย่างดี',
      image: '6.png',
      name: 'SIX OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ความหมายไพ่ใบนี้จึงหมายถึงการ รักษาตำแหน่ง รักษาสิ่งที่เราคิดว่าถูก รักษาสิทธิ์ที่เป็นของเรา ต่อสู้กับปัญหาต่างๆที่เข้ามา จากสิ่งที่เราอาจจะยังไม่รู้ชัดว่าคืออะไร บางทีเราอาจจะคิดมากไปเองหรือกังวลเกินไป',
      love:
      'ความสัมพันธ์เหมือนมีอุปสรรคเข้ามา หรือแม้แต่ปัญหาภายใน เรื่องการที่อีกฝ่ายทำร้ายจิตใจคุณ ให้คุณต้องต่อสู้ฝ่าฟันเพื่อรักษาความสัมพันธ์ให้คงอยู่ต่อไป และอาจหมายถึงการต่อสู้เพื่อรักษาตัวตนของตัวเองในความสัมพันธ์ได้ด้วย',
      image: '7.png',
      name: 'SEVEN OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ไพ่ใบนี้แปลได้ว่า จะมีการเปลี่ยนแปลง มีเรื่องเข้ามากระทันหัน รวดเร็ว จนคุณตั้งตัวไม่ทัน ส่วนใหญ่จะแปลไปในทางที่ดี',
      love:
      'ความสัมพันธ์เป็นไปอย่างรวดเร็ว ความรักพัฒนาไปอย่างรวดเร็ว มีความคืบหน้า มีเรื่องเซอร์ไพรซ์ หากเป็นโสดก็มีความเป็นไปได้ถึงการที่มีคนเข้ามาทำให้ชอบ ทำให้รักอย่างรวดเร็ว ไม่ทันตั้งตัว',
      image: '8.png',
      name: 'EIGHT OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ทุกครั้งที่ผิดพลาดล้มเหลว ชายในไพ่ใบนี้จะได้รับบาดแผลแต่ก็ทำให้เค้าได้ประสบการณ์ความรู้ ไพ่ใบนี้จึงแปลได้ถึง การทำงานที่มีประสบการณ์ เพราะที่ผ่านมาอาจจะหนัก และล้มเหลวมาแล้ว จนทำให้รู้ถึงปัญหาและวิธีแก้ไขได้',
      love:
      'ความสัมพันธ์ที่เรียกได้ว่า เจ็บมาเยอะ จนทำให้มีประสบการณ์มามาก และทำให้มีรู้วิธีในการแก้ไขปัญหาความสัมพันธ์ต่างๆ ที่เข้ามา ได้อย่างดี ไพ่ใบนี้ในมุมมองหลักๆจึงเป็นความหมายที่ดี ที่สามารถดำเนินความสัมพันธ์ต่อไปได้ เพราะเรามีประสบการณ์ที่จะจัดการ',
      image: '9.png',
      name: 'NINE OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ไพ่ใบนี้แปลได้เลยว่าหมายถึง งานที่ครบ งานที่เต็ม ความปรารถนาความต้องการที่เต็มเปี่ยม แต่จาก ไพ่จะเห็นว่ามันยังไม่ถึงจุดสิ้นสุด ถึงแม้จะใกล้แล้วก็ตาม ดังนั้นสิ่งที่เราทำคือการ แบกรับ มันไว้ เพื่อให้ไปถึงจุดหมายที่เราตั้งเป้าไว้ อาจหมายถึงงานที่หนัก ภาระในจิตใจที่หนักอึ้ง แต่เราก็ยังคงเดินหน้าต่อไปยังเป้าหมายได้',
      love:
      'ถึงไพ่หมายเลข 10 จะหมายถึงการครบ จบสมบูรณ์ แต่ไพ่ใบนี้นั้นยังไม่ค่อยสมบูรณ์เท่าไหร่ ไพ่ใบนี้จะหมายถึงความสัมพันธ์ที่หนักอึ้ง อาจเป็นภาระด้านอื่นๆ เช่น เรื่องงาน เงิน ครอบครัว ที่อาจไม่เห็นด้วย',
      image: '10.png',
      name: 'TEN OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ไพ่ใบนี้จึงหมายถึงการเปลี่ยนแปลงหรือการเริ่มพัฒนา เริ่มต้น สิ่งใหม่ๆที่มีแรงผลักดัน มีแรงบันดาลใจ เช่น การผจญภัย การทำงานใหม่ทีท้าทายขึ้น และเราก็พร้อมที่จะลุยไป',
      love:
      'ความรักความสัมพันธ์ของไพ่ใบนี้ มักแปลถึงการเริ่มต้น การเปลี่ยนแปลง ความต้องการในการพัฒนาความสัมพันธ์ เป็นการเริ่มความรักที่ค่อนข้างจะรุนแรง หรือวัยรุ่นซะหน่อย คือมีความรักที่มาก เป็นความรักที่เหมือนการผจญภัย มีเรื่องน่าตื่นเต้นหวือหวาตลอดเวลา',
      image: '11.png',
      name: 'PAGE OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ความหมายคือ การเดินหน้า ลุยทำในสิ่งที่ใจต้องการ จนบางทีอาจจะเป็นพวกรีบร้อน ทำอะไรโดยไม่คิดให้รอบคอบได้ อาจจะหมายถึงการที่ตะลุยทำงานอย่างมุ่งมั่น ตั้งใจ ด้วยพลังงานที่เปี่ยมล้น แต่ต้องระวังเรื่องความสะเพร่าด้วยเช่นกัน',
      love:
      'ไพ่ใบนี้หมายถึงความสัมพันธ์ที่เดินหน้าไปด้วยความรวดเร็ว ไปเร็วด้วยความต้องการ มีพลังพร้อมจะฝ่าฟันอุปสรรค มองในแง่ดีก็ถือว่าดี แต่เรื่องความรัก บางทีก็อาจจะขาดความรอบคอบไปซะหน่อย จนอาจจะทำให้ความสัมพันธ์ไม่ยืดยาวหรือยั่งยืนนัก',
      image: '12.png',
      name: 'KNIGHT OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'คนที่ได้ไพ่ใบนี้ (โดยเฉพาะผู้หญิง) เป็นคนที่มีความมั่นใจ สดใส มีความมุ่งมั่นสูง มีความฝัน ชอบปาร์ตี้สังสรรค์และทำงานเก่ง จู้จี้จุกจิก ถ้าหากได้ไพ่ใบนี้ขึ้นมา ก็อาจจะหมายถึงการที่จะได้พบ ผู้หญิงที่มีลักษณะแบบที่กล่าวมา เข้ามาในสถานการณ์ของคุณ',
      love:
      'ไพ่ราชินีไม้เป็นลักษณะของผู้หญิงที่มีสเน่ห์ มีความมุ่งมั่น ในการทำงาน ความฝัน และมีความเฟรนลี่ เพื่อนเยอะ ชอบสังคม ทำให้ดึงดูดคนเข้ามามากมาย แต่ถ้าโสดอยู่ ก็จะตอบได้ว่าผู้หญิงคนนี้ยังไม่คิดที่จะลงเอยกับใคร เพราะเธอค่อนข้างจะสามารถอยู่ตัวคนเดียวได้ พึ่งพาตัวเองได้',
      image: '13.png',
      name: 'QUEEN OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'คนที่ได้ไพ่ใบนี้จึงเป็นคนที่ค่อนข้างกระตือรือร้น มีแรงผลักดัน เพื่อให้ได้ในสิ่งที่ตัวเองต้องการ และเนื่องจากมีความเป็นผู้ใหญ่จากการเป็นราชา ไพ่ไม้เน้นไปที่เรื่องงาน ถ้าได้ใบนี้ก็เรียกได้ว่า อาจจะได้ทำงานเป็นหัวหน้า หรือเป็นคนที่เก่งในเรื่องงาน เป็นผู้นำในการทำงานได้อย่างดี',
      love:
      'ไพ่ใบนี้อาจจะเรียกได้ว่าเป็นความสัมพันธ์ที่มีพลังงาน มีแรงผลักดันในการพากันไปในเป้าหมายของความรักที่ต้องการได้  นอกจากนี้ยังหมายถึงความรักที่ใช้ความปรารถนาเป็นตัวนำพาไปได้ด้วย',
      image: '14.png',
      name: 'KING OF WANDS',
    ),

  ];
  final List<cardTarots22> cards22 = [
    cardTarots22(
        work:
        'หมายถึงการเริ่มต้นกิจการใหม่ๆหรือหมายถึงการเบื่อๆเรื่องงานอยากไปพักร้อน',
        money:
        'ภาวะทางการเงินจะไม่แน่นอนคาดหวังความสม่ำเสมอไม่ได้',
        love:
        'หมายถึงคนเจ้าชู้และอิสระสูงไม่ชอบให้แฟนมาคุม',
        health: 'ระวังเกี่ยวกับระบบความดันโลหิต',
        image: '1.png',
        name: 'The Fool'),
    cardTarots22(
        work:
        'เหมาะกับงานที่เกี่ยวข้องกับคนจำนวนมากๆเช่นพิธีกร ดีเจ วีเจ งานการสอนก็ดี เพราะสามารถสื่อให้คนเข้าใจได้ง่าย หรือทำงานไม่ตรงกับสายที่เรียนมา',
        money:
        'หมายถึง จะมีสภาพการเงินที่ดีขึ้น ส่วนใหญ่ตามที่ดูมา จะไม่ดีมาก แต่ก็ไม่แย่ หากเงินหมดก็สามารถหามาได้ทัน',
        love:
        'คนรักใหม่และคนรักเก่าจะมาในช่วงที่คุณไม่อยากมีความรักเท่าใดนัก หากแอบชอบใครอยู่อาจไม่สมหวัง',
        health: 'ระวังระบบทางเดินหายใจและระบบปลายประสาทอักเสบ',
        image: '2.png',
        name: 'The Magician'),
    cardTarots22(
        work:
        'ธุรกิจจะดำเนินไปอย่างเชื่องช้าในระยะแรก อาชีพที่เหมาะสมคือศิลปินทุกรูปแบบหรืองานพวกการสืบสวน ก็ได้',
        money:
        'คุณจะต้องใช้ความอดทน การเงินจะมาแบบช้าๆ',
        love:
        'ในท่านชายอาจพบหญิงคนหนึ่งที่มีเสน่ห์น่าลุ่มหลง ในท่านหญิงอาจจะเป็นรักข้างเดียวหรือรักซ้อนก็ได้',
        health: 'เนื่องจากไพ่ใบนี้เกี่ยวกับธาตุน้ำ จึงควรระมัดระวังระบบการย่อยอาหาร ไต หรือระบบปัสสาวะ',
        image: '3.png',
        name: 'The High Priestress'),
    cardTarots22(
        work:
        'ถ้าจะค้าขายก็เหมาะของสวยๆงามๆหรือไม่ก็พวกอิเล็กโทรนิคไปเลย ส่วนงานยังไม่เสร็จตามกำหนดต้องแก้ไขปรับปรุง',
        money:
        'ได้แน่นอนแต่ช้า การทวงหนี้ไม่โกงแต่คุณได้ช้า หากจะขอความช่วยเหลือก็เป็นเพศหญิงที่ขาวๆรูปร่างอวบๆ ดีกว่า',
        love:
        'เป็นไพ่ของความสมหวัง อาจลงท้ายด้วยการแต่งงาน หรือหมายถึง การมีเพศสัมพันธ์ที่เกิดจากความรัก การตั้งครรภ์ หรือมีการหึงหวงถ้ามีไพ่ 7 ดาบมาประกบติดล่ะก็หึงจนน่ารำคาญเลยเชียว',
        health: 'ระวังเกี่ยวกับระบบการสืบพันธุ์เช่นมดลูก',
        image: '4.png',
        name: 'The Empress'),
    cardTarots22(
        work:
        'ลักษณะงานที่ถูกโฉลกจะเกี่ยวกับวิทยาศาสตร์ เทคโนโลยีสมัยใหม่ การเมือง ราชการ ถ้ามีการเจรจาแบ่งผลประโยชน์ จะเป็นไปอย่างราบรื่น',
        money:
        'ควรระมัดระวังการใช้จ่ายอย่างฟุ่มเฟือยหน้าใหญ่ใจกว้าง เงินจึงมักขาดมือแต่ว่าสามารถหามาได้ทันกัน',
        love:
        'สำหรับท่านหญิงที่หยิบได้ไพ่ใบนี้ แปลได้ว่าจะพบรักกับชายอายุมากกว่าหรือเป็นคนต่างชาติ หรือหมายถึงเราออกไปเข้าสังคมมากขึ้น่',
        health: 'ระวังที่ศีรษะ มักจะมีอาการปวดหัวได้ง่าย',
        image: '5.png',
        name: 'The Emperor'),
    cardTarots22(
        work:
        'หมายถึงคุณอาจจะมีปัญหาจุกจิกๆ ในงาน หรือมีคนจุกจิกใส่คุณ อาชีพที่เหมาะสม มักจะรับราชการ แพทย์ ครู',
        money:
        'หมายถึง คุณจะวางแผนการเงินใหม่แต่อย่าเคร่งครัดมากนะ ถ้าหากตบะแตกขึ้นมาเงินเก็บจะพลอดหดหายไปด้วย',
        love:
        'หากผู้หญิงเปิดได้ไพ่ใบนี้หมายถึง ได้แต่งงานช้าหรือคู่อายุแก่กว่ามาก และหากได้แต่งก็จะทำพิธีอย่างถูกต้องตามประเพณี',
        health: 'ให้ระมัดระวังระบบการย่อย ท้องอืด ท้องเฟ้อ',
        image: '6.png',
        name: 'The Hierophant'),
    cardTarots22(
        work:
        'อาจจะได้เปลี่ยนงานใหม่ ได้หุ้นส่วนที่ดีหรือคุณจะมีทางสายใหม่ที่ดีกว่าเดิมให้ทำ',
        money:
        'การเงินสามารถหามาได้เรื่อยๆ แบบสบายๆ',
        love:
        'ไม่ต้องสงสัยเลยว่าคุณกำลังอยู่ในช่วงกำลังมีความรัก อย่าเฉื่อยชาหรือกระตือรือล้นจนเกินไป หากเป็นคนโสด ก็จะพบรักในเวลาไม่นานนัก',
        health: 'ระวังพวกลมในกระเพาะอาหาร การจุกเสียด',
        image: '7.png',
        name: 'The Lover'),
    cardTarots22(
        work:
        'หมายถึง เหมาะกับงานที่เกี่ยวกับการขนส่งทุกชนิด การเป็น สจ๊วต หรือ แอร์ มักจะได้ไพ่ใบนี้ หรือการจะหมายถึงการทำงานกับคนต่างชาติ ต้องใช้ภาษาต่างต่างประเทศก็ได้',
        money:
        'หมายถึง ต้องเผชิญปัญหาการเงิน แต่ก็สามารถผ่านพ้นมาได้ ต้องมีการโต้เถียง หรือขัดแย้งกัน จึงจะได้เงินนั้นมา',
        love:
        'คนโสด คุณอาจพบรักกับคนแปลกหน้า คนที่มีคนรักแล้วอาจจะมีปัญหาจำเป็นต้องแยกกันสักพักและกลับมาคืนดีกัน',
        health: 'มักเกี่ยวกับระบบการย่อยการขับถ่ายไม่ดี',
        image: '8.png',
        name: 'The Chariot'),
    cardTarots22(
        work:
        'คุณอาจจะได้รับรางวัลแห่งความสำเร็จในความเพียร หรืองานเกี่ยวกับการดูแลความงามก็ได้',
        money:
        'เงินที่คาดหวังไว้จะได้มา ความยุ่งยากทางการเงินจะได้รับการแก้ไข',
        love:
        'หมายถึงหากคุณเพิ่งพบใครบางคน เวลาจะเป็นตัวช่วยให้ความรักของคุณมั่นคงขึ้น ในรายที่ไม่มีแฟน คุณยังไม่พร้อมที่จะรักใครเนื่องจากยังอาวรณ์กับความหลัง',
        health: 'แข็งแรงมาก หรือฟื้นตัวจากการไม่สบาย',
        image: '9.png',
        name: 'The Strength'),
    cardTarots22(
        work:
        'งานที่ทำเหมาะกับโครงการระยะยาว หากถามถึงงานที่ทำอยู่ ก็มักจะได้ดีในภายหลัง ถ้ากล่าวถึงอาชีพ เหมาะกับ แพทย์ อาจารย์ นักเขียน นักวิชาการ',
        money:
        'หมายถึง เงินที่เข้ามาเป็นระลอก มีมากพอที่จะจ่ายลงไป',
        love:
        'เป็นช่วงเวลาที่อยู่ตามลำพัง รู้สึกเหงา ไม่มีใคร หรือหมายถึงการได้แต่งงานเมื่ออายุมากแล้วและรวมทั้งถ่านไฟเกิดคุขึ้นมาอีก คนรักเก่าอาจกลับเข้ามาสู่ชีวิตคุณอีกครั้งหนึ่ง',
        health: 'อาการเหมือนโรคซึมเศร้า',
        image: '10.png',
        name: 'The Hermit'),
    cardTarots22(
        work:
        'หมายถึง เจ้าชะตายังไม่พอใจกับเรื่องของงานมากนัก อยากจะทำให้ดีกว่าเดิม หมายถึงทำงานเกี่ยวกับด้านบ้านและที่ดินก็ได้',
        money:
        'การเงินจะมีพอเข้ามาให้ใช้จ่ายทำให้ไม่กังวลใจมากนัก',
        love:
        'หากมีความสัมพันธ์อยู่แล้วหมายถึงการคบกันสบายๆไม่หึงหวงซึ่งกันและกัน และอาจจะมีคนรักเก่ากลับเข้ามาในชีวิตอีกครั้งหนึ่ง ในคนโสด มีแนวโน้มว่า จะได้พบใครสักคนท่ามกลางคนหมู่มาก',
        health: 'ระวังโรคในช่องท้อง พวกกระเพาะอาหาร ตับ ไต',
        image: '11.png',
        name: 'The Wheel of Fortune'),
    cardTarots22(
        work:
        'ในการทำงานจะได้รับความยุติธรรมจากคนรอบข้าง เหมาะที่จะทำงานเกี่ยวกับราชการรัฐวิสาหกิจ หากมีไพ่ 6 ไม้ขึ้นประกอบจะชัดเจนยิ่งขึ้น งานด้านอื่น เช่น งานบัญชี สถาปนิก',
        money:
        'สถานะการเงินเป็นแบบมาเร็วไปเร็ว',
        love:
        'จากประสบการณ์แล้วหากมีเพศตรงข้ามเข้ามาติดพันและหลงคุณมากๆ ต้องระวังให้มากเค้าจะแค่หลงอยู่พักหนึ่งแล้วก็จะจากไป',
        health: 'ส่วนใหญ่จะไม่ค่อยเจ็บป่วย',
        image: '12.png',
        name: 'Justice'),
    cardTarots22(
        work:
        'หมายถึง เป็นช่วงที่ต้องมีความอดทนกับสภาวะการงาน/ธุรกิจที่ทำอยู่ เริ่มส่อเค้าปัญหา ',
        money:
        'จะมีปัญหาด้านการเงิน มีคนจะมาเอาเปรียบด้านการเงิน คนที่มีหนี้สินมักจะได้ไพ่ใบนี้ระวังการค้ำประกันหน่อยก็จะดี',
        love:
        'หากเป็นคนโสด หมายถึง มีความโหยหาในเรื่องความรัก มีความอ่อนไหว หากเพิ่งเริ่มคบกัน อย่างเพิ่งเทใจ',
        health: 'หมายถึงโรคเบาหวาน ในท่านหญิงระวังเกี่ยวกับ มดลูกด้วย',
        image: '13.png',
        name: 'The Hanged Man'),
    cardTarots22(
        work:
        'หมายถึง อาจมีความล้มเหลว ผิดหวัง หุ้นส่วนแตกคอกัน ไพ่ใบนี้เหมาะกับอาชีพ แพทย์ พยาบาล ประกันภัย ประกันชีวิต ตำรวจ หรือทหาร หรือบริษัทประเภท ก๊าซ น้ำมัน สารเคมี',
        money:
        'หมายถึง รายได้ค่อนข้างแย่มาก รายได้ตกลงอย่างเห็นได้ชัด ต้องระวัง เงินหาย ถูกยกเค้า โดนล้วงกระเป๋า',
        love:
        'หากมีคนรักจะมีปัญหา จนอาจเลิกกันได้ ในคนโสด หมายถึง จะพบกับคนที่น่าหลงใหลอย่างมาก',
        health: 'อาจเจ็บป่วยกระทันหัน ป่วยหนักต้องเข้าโรงพยาบาล',
        image: '14.png',
        name: 'Death'),
    cardTarots22(
        work:
        'หมายถึง มีโอกาสย้ายงาน หรือออกจากงานค่อนข้างสูง หากเปิดได้ในขณะทำนายภาวะปัจจุบัน มีการเดินทางไปพบปะผู้คน เพื่อเจรจาตกลงทางธุรกิจ',
        money:
        'หมายถึง มีการหมุนเงินเยอะมากในช่วงนี้',
        love:
        'หากกำลังมีปัญหากับคนรักอาจต้องการเลิกรา ที่เลิกก็จะกลับมารักกัน คนโสด เพื่อนแนะนำใครบางคนมาให้',
        health: 'การทำงานโดยไม่หยุดพัก ทำให้ร่างกายอ่อนแอ',
        image: '15.png',
        name: 'Temperance'),
    cardTarots22(
        work:
        'ไพ่ใบนี้จะให้ผลดีกับผู้ที่ทำงานเกี่ยวกับอบายมุขทั้งปวง เช่น เปิดบ่อน ขายเหล้า เบียร์ เปิดผับ บาร์ อาบอบนวด เป็นต้น หากเป็นคนทำงานปกติทั่วไป มักจะมีงาน Part time เข้ามา',
        money:
        'หมายถึงการทำงานหนักมาก หากทำธุรกิจของตนเอง จะได้กำไรน้อยมาก ไม่สมกับที่ลงแรงทำลงไป',
        love:
        'หมายถึง จะมีแรงดึงดูดระหว่างกันและกันอย่างมิอาจต้านทานได้ ภายหลังจากความปรารถนาอันแรงกล้าผ่านไปแล้ว อาจพบว่าไม่มีอะไรเหมือนกันเลยทำให้ต้องเลิกกันไป',
        health: 'มีโอกาสเป็นเกี่ยวกับโรคทางเพศสัมพันธ์',
        image: '16.png',
        name: 'The Devil'),
    cardTarots22(
        work:
        'หมายถึง สิ่งที่คิดว่ากำลังไปได้ด้วยดีกลับพังทลายลงอย่างไม่คาดคิด ปัญหามักจะเกิดกะทันหันโดยไม่ทันตั้งตัว',
        money:
        'จะเกิดการสูญเสียเงิน หรือเสียเงินก้อนโตนับตั้งแต่ที่เคยเสียมา',
        love:
        'อาจจะอกหัก หรือมีการหย่าร้างเกิดขึ้น หากเป็นคนโสดและมีไพ่ความรักที่ดีใบอื่นประกบอยู่หมายถึงจะพบรักกะทันหัน',
        health: 'ระวังการเจ็บป่วยแบบกระทันหันหรืออุบัติเหตุ',
        image: '17.png',
        name: 'The Tower'),
    cardTarots22(
        work:
        'หมายถึง ต้องการปรับปรุงให้ดีขึ้นต่อไป งานที่เกี่ยวข้องกับความสวยงาม ศิลปะจะดีมาก รวมถึงงานก่อสร้างบ้านเรือน วัสดุก่อสร้าง หรือของตกแต่งบ้านก็ได้',
        money:
        'คาดการณ์สิ่งใดเกี่ยวกับการเงินไว้มักจะได้ตามที่คาด',
        love:
        'หมายถึง ส่วนใหญ่ผู้ที่ได้มักเป็นโสด โดยใช้เวลาส่วนใหญ่กับเพื่อนฝูง',
        health: 'เมื่อไพ่ใบนี้ปรากฏมักเป็นข่าวดี มักเป็นการฟื้นตัวจากความเจ็บป่วย',
        image: '18.png',
        name: 'The Star'),
    cardTarots22(
        work:
        'หมายถึง อย่าวู่วาม ต้องควบคุมอารมณ์อย่างมาก อาจมีคนกลั่นแกล้งในงานระมัดระวังปัญหาเกี่ยวกับเอกสารต่างๆ ให้ดี',
        money:
        'หมายถึงต้องระมัดระวังอาจถูกโกงเงินหุ้นส่วนเอาเปรียบ ระมัดระวังด้านเอกสารให้ดี',
        love:
        'หากมีคนรักแล้ว อาจถูกคนรักหลอกลวงอยู่ หากเป็นคนโสด หมายถึง คนกำลังโหยหาความรักอย่างมาก',
        health: 'ระวังระบบเลือด น้ำเหลือง และมดลูกไม่ดี',
        image: '19.png',
        name: 'The Moon'),
    cardTarots22(
        work:
        'จะได้งานใหม่หากตกงานอยู่ ธุรกิจส่วนตัวจะคล่องตัวขึ้นการติดต่อการงานกับผู้ใหญ่ จะเป็นไปอย่างราบรื่นแต่ต้อง',
        money:
        'หากรอข่าวใดอยู่ จะได้รับข่าวดี มักจะมีชื่อเสียงในการทำงานก่อน เงินจึงจะได้รับตามมาภายหลัง',
        love:
        'หมายถึงจะได้คู่ที่ดี ช่วยส่งเสริมกันและกันให้เจริญรุ่งเรือง หากยังไม่มีคนรักก็จะมีเข้ามา ทำนองว่าช้าแต่ชัวร์',
        health: 'โดยส่วนมากแข็งแรง แต่ก็ต้องระวังเรื่องความดันโลหิตไว้บ้างก็จะดี',
        image: '20.png',
        name: 'The Sun'),
    cardTarots22(
        work:
        'หากเพิ่งลาออกจากงานก็จะได้งานใหม่ในเวลาไม่นานนัก จากประสบการณ์มักจะได้งานจากเพื่อนฝูงบอกต่อมาให้มา',
        money:
        'จะเห็นได้ชัดว่า เริ่มมีการเปลี่ยนแปลงในทางที่ดีขึ้น เรื่องการเงิน หากลงทุนอะไรลงไปก็จะได้รับผลตอบแทนค่อนข้างดี',
        love:
        'จะหมายถึง เป็นเรื่องที่ต้องตัดสินใจ เนื่องจากคนรักเก่าได้หวนกลับมา แต่ถ้าได้ไพ่ใบนี้ประกบ8ไม้จะอาการเหมือนกับรักแรกพบเลยล่ะ',
        health: 'มักฟื้นตัว แต่ถ้าป่วยก็มักเป็นโรคเดิมที่เคยป่วย',
        image: '21.png',
        name: 'Judgement'),
    cardTarots22(
        work:
        'หมายถึงงานที่ทำมานานจะประสบความสำเร็จตามที่หวังโดยเฉพาะในสายงานศิลปะงานพวกนายหน้าขายที่ดินก็ดีเช่นกัน',
        money:
        'หมายถึง เงินจะมาจากหลายๆ ทาง ส่วนใหญ่ จะมาจากสิ่งที่คุณทำมาแล้วเป็นระยะเวลานาน',
        love:
        'หากเปิดไพ่ Empress และ The Sun มาประกบคู่กันหมายถึงการมีบุตร',
        health: 'มสุขภาพแข็งแรง',
        image: '22.png',
        name: 'The world'),


  ];


  @override
  Widget build(BuildContext context) {
    Random random = new Random();
    int randomNumber = random.nextInt(cards22.length);
    return  Scaffold(
      appBar: AppBar(title:Text(''),
        backgroundColor: Colors.orangeAccent,),
      body: Stack(
        children: [
          Container(
            decoration: BoxDecoration(
              image: DecorationImage(
                image: AssetImage("assets/images/bg/prm2.jpg"),
                fit: BoxFit.cover,
              ),
            ),
            child: null /* add child content here */,
          ),
          Center(
            child: FlipCard(
              direction: FlipDirection.HORIZONTAL,
              front: Image.asset(
                'assets/images/cards/ไพ่ชุดใหญ่/${cards22[_position].image}',
                width: 230,
                height: 400,
                fit: BoxFit.contain,

              ),
              back: Container(
                width: 230,
                height: 400,
                color: Colors.white,
                child: Padding(
                  padding: const EdgeInsets.all(10.0),
                  child: Column(
                    children: [
                      Container(
                        decoration: BoxDecoration(
                          image: DecorationImage(
                            image: AssetImage("assets/images/bg/prm2.jpg"),
                            fit: BoxFit.cover,
                          ),
                        ),
                      ),
                      Padding(
                        padding: const EdgeInsets.all(8.0),
                        child: Text("${cards22[_position].name}",style: TextStyle(fontWeight: FontWeight.bold, fontSize: 15,color: Colors.black), textAlign: TextAlign.center),
                      ),

                      Padding(
                        padding: const EdgeInsets.all(4.0),
                        child: Text('การงาน '
                            ,style: TextStyle(fontWeight: FontWeight.bold,fontSize: 13,color: Colors.black), textAlign: TextAlign.start),
                      ),
                      Text('${cards22[_position].work}'
                          ,style: TextStyle(fontSize: 13,color: Colors.black)),
                      Padding(
                        padding: const EdgeInsets.all(4.0),
                        child: Text('การเงิน '
                            ,style: TextStyle(fontWeight: FontWeight.bold,fontSize: 13,color: Colors.black), textAlign: TextAlign.start),
                      ),

                      Text('${cards22[_position].money}'
                          ,style: TextStyle(fontSize: 13,color: Colors.black)),
                      Padding(
                        padding: const EdgeInsets.all(4.0),
                        child: Text('ความรัก '
                            ,style: TextStyle(fontWeight: FontWeight.bold,fontSize: 13,color: Colors.black), textAlign: TextAlign.start),
                      ),

                      Text('${cards22[_position].love}'
                          ,style: TextStyle(fontSize: 13,color: Colors.black)),
                      Padding(
                        padding: const EdgeInsets.all(4.0),
                        child: Text('สุขภาพ  '
                            ,style: TextStyle(fontWeight: FontWeight.bold,fontSize: 13,color: Colors.black), textAlign: TextAlign.start),
                      ),

                      Text('${cards22[_position].health}'
                          ,style: TextStyle(fontSize: 13,color: Colors.black)),
                    ],
                  ),
                ),
              ),
            ),
          ),


        ],
      ),
    );
  }
}

