import 'package:flip_card/flip_card.dart';
import 'package:flutter/material.dart';

import '../../model/cardTarotsSword.dart';

class cardSword extends StatefulWidget {
  final position;
  const cardSword({Key? key, required this.position}) : super(key: key);

  @override
  _cardSwordState createState() => _cardSwordState();
}

final List<cardTarotsSword> cardsSword = [
  cardTarotsSword(
    meaning:
    'หมายถึงความชัดเจน การตัดสินใจที่เด็ดขาด เหมือนถึงเวลาแล้วที่คุณจะเริ่มต้นทำอะไรที่ถูกต้องตามหลักเหตุผล ไพ่ใบนี้ความหมายดีไม่ดี ก็แล้วแต่มุมมอง บางทีก็อาจทำให้คุณรู้สึกแย่ทางอารมณ์ แต่การตัดสินใจเลือกทางที่ถูกตามหลักเหตุผลย่อมดีกว่าอยู่แล้ว',
    love:
    'ในด้านความรัก ใบนี้ค่อนข้างจะดีทีเดียว หมายถึงการเริ่มต้นใหม่ ความรู้สึกใหม่ๆ ที่ทำให้เรารู้สึกดี หากถามว่าอีกฝ่ายรู้สึกยังไงแล้วไพ่ใบนี้แทนเค้า หรือไพ่ใบนี้ขึ้นแทนตัวเราในสถานการณ์ก็หมายถึงอารมณ์ที่รุนแรง เต็มไปด้วยพลัง ความชอบ ความรัก ที่พร้อมจะพุ่งชน พุ่งจีบ ทีเดียว  ',
    image: '1.png',
    name: 'ACE OF SWORDS',
  ),
  cardTarotsSword(
    meaning:
    'หญิงสาวผู้ปิดตานั่งนิ่งถือดาบที่เปรียบเสมือนความคิด หลักการ การตัดสินใจ ไว้สองข้าง ด้านหลังเป็นทะเลที่นิ่งและโขดหินที่เปรียบเสมือนอารมณ์ที่มีอะไรมาขวางกั้นเป็นอุปสรรคที่ทำให้ไม่สามารถเลือกฟาดฟันดาบได้ ไพ่ใบนี้หมายถึง การตัดสินใจไม่ได้ ไม่สามารถตัดสินใจปัญหาด้วยหลักการและเหตุผลได้',
    love:
    'หมายถึงความสัมพันธ์ที่พยายามหลีกหนีปัญหา ไม่ตัดสินใจ ปล่อยปัญหาให้คาราคาซัง บางทีคุณก็รู้สึกไม่โอเคกับความสัมพันธ์ แต่คุณก็ยังไม่ตัดสินใจที่จะเดินออกมา จนอาจทำให้รู้สึกอึดอัด',
    image: '2.png',
    name: 'TWO OF SWORDS',
  ),
  cardTarotsSword(
    meaning:
    'เหมือนจะเกิดเรื่องบางเรื่องที่ทำให้คุณได้รับรู้ความจริง ได้รับรู้เหตุผล ต่างๆ แล้วมันก็ทำร้ายจิตใจคุณได้ ทำให้คุณรู้สึกเศร้า จิตตก แต่ไพ่ใบนี้อาจจะพูดได้ถึงในหลายๆด้านได้ เช่น เรื่องการงาน การเงิน นอกจากนี้ความเป็นเลขสาม อาจหมายถึง เรื่องการเลือก การรักสามเส้าได้อีกด้วย',
    love:
    'อาจเป็นรักที่ทำให้เรารู้สึกขัดแย้งอยู่ภายใน ความรักที่ เรารักมากจริงๆแต่ก็มีสิ่งที่ทำให้เราแย่ในด้านเหตุผล เช่น เค้าไม่รักเรา เค้าไม่สนใจ เค้าพูดทำร้ายจิตใจเรา หรืออื่นๆ เป็นสิ่งที่ทำให้คุณรู้สึกแย่',
    image: '3.png',
    name: 'THREE OF SWORDS',
  ),
  cardTarotsSword(
    meaning:
    'ไพ่ใบนี้มีความหมายถึงการหยุดพัก ทั้งทางใจและกาย เป็นไพ่ที่ปัญหาอาจจะยังไม่จบก็ได้ แต่คุณก็ขอพักไว้ก่อนนะตอนนี้',
    love:
    'ในด้านความรัก ความหมายชัดๆคือ การหยุดพัก ในปัญหาที่เกิดขึ้น ป็นไพ่ที่ดีสำหรับคนที่ได้ไพ่ใบนี้ เพราะจะมีความสบายใจ ฟื้นฟูความรู้สึกของตัวเองให้ดีขึ้นได้',
    image: '4.png',
    name: 'FOUR OF SWORDS',
  ),
  cardTarotsSword(
    meaning:
    'หากมองในมุมผู้ชนะ ก็เหมือนผู้ชนะการประลอง เป็นเจ้ายุทธจักรที่ชนะก็จริง แต่สิ่งที่ต้องสูญเสียไประหว่างการต่อสู้ก็ไม่ได้มีอะไรกลับมา หากมองในมุมผู้แพ้ ก็คือผู้ที่ต้องพ่ายแพ้ไป สูญเสียความมั่นใจ และต้องเดินจากไปจากสถานการณ์นี้ พ่ใบนี้จึงมองไปในแง่ลบ มีการขัดแย้งกัน ทะเลาะกัน และมีการสูญเสีย',
    love:
    'ความรักในไพ่ใบนี้ก็เป็นการทะเลาะกัน การขัดแย้งกัน ความไม่เข้าใจกัน ต่างฝ่ายต่างมีอีโก้ มีเหตุผลของแต่ละฝ่าย ซึ่งเข้ากันไม่ได้',
    image: '5.png',
    name: 'FIVE OF SWORDS',
  ),
  cardTarotsSword(
    meaning:
    'เป็นไพ่ที่มีความหมายถึงการเดินต่อไปข้างหน้า มุ่งหน้าต่อไป ทิ้งความรู้สึกไม่ดีไว้เบื้องหลัง, เวลาแห่งการเปลี่ยนแปลงได้มาถึงแล้ว, ความสัมพันธ์ที่ยังไม่จบสิ้น แต่อาจมองได้หลายแบบ ว่าเราจะเลือกเดินหน้าเปลี่ยนแปลงไปทางไหน แต่หลักสำคัญของมันก็คือ เราทิ้ง เราปล่อยสิ่งที่ไม่ดีต่อเรา สิ่งที่ไม่ดีกับใจเราไว้ด้านหลัง',
    love:
    'ในเรื่องความรักความสัมพันธ์ ไพ่ใบนี้ส่วนใหญ่มักแปลว่า ความสัมพันธ์ที่ยังไม่จบ โดยเฉพาะถ้าถามถึงความสัมพันธ์ที่ไม่โอเค ไม่ดี ก็ต้องบอกว่า มันยังไม่จบ เรายังมีรักษาความสัมพันธ์นั้นออกไป โดยทิ้งสิ่งที่ไม่โอเคไว้เบื้องหลัง',
    image: '6.png',
    name: 'SIX OF SWORDS',
  ),
  cardTarotsSword(
    meaning:
    'ไพ่ใบนี้ความหมายอาจแปลได้ตรงๆว่า โดนขโมยเงิน สิ่งของก็ได้ หรือโดนขโมยความคิดก็ได้ เช่น โดนขโมยผลงาน ขโมยแนวคิด อาจหมายถึงการแอบทำลับหลังเป็นได้ทั้งร้าย เช่น การโกง การแอบนินทา ใส่ร้ายป้ายสี ขโมย และทั้งดี เช่น การวางแผนที่ไม่ให้ใครรู้เพื่อผลลัพธ์ที่ดีกว่า การวางแผนทำเซอไพรซ์ เป็นต้น',
    love:
    'ในด้านความรัก ไพ่ใบนี้แปลได้ทั่วไปว่า การโกง แอบไปมีคนอื่น การไม่รักเดียวใจเดียว ไม่ซื่อสัตย์ คนที่ได้ไพ่ใบนี้ขึ้นแทนตำแหน่งตนเอง กำลังไม่ซื่อสัตย์กับคุณ เค้ากำลังแอบทำลับหลังคุณ',
    image: '7.png',
    name: 'SEVEN OF SWORDS',
  ),
  cardTarotsSword(
    meaning:
    'ความหมายของไพ่ใบนี้คือ การที่เราไม่สามารถเลือกทำอะไรได้เลย ไม่สามารถตัดสินใจ ไม่สามารถดำเนินการได้ เหมือนคุณโดนกรอบความคิดของตัวเองล้อมเอาไว้ แม้อยากจะไปก็ไปไม่ได้ และไพ่ใบนี้ก็ยังหมายถึงการถูกกักขัง ไม่ว่าจะกักขังจองจำจริงๆ หรือโดนกักขังทางความคิด',
    love:
    'ไพ่ใบนี้ความหมายค่อนข้างจะออกติดลบ มันเหมือนเป็นความสัมพันธ์ที่ทำให้คุณ "กลับตัวก็ไม่ได้ ให้เดินต่อไปก็ไปไม่ถึง" ไม่สามารถเลือกได้ เพราะโดนความคิดครอบงำไว้จนตัดสินใจไม่ได้ว่าจะทำยังไงดี',
    image: '8.png',
    name: 'EIGHT OF SWORDS',
  ),
  cardTarotsSword(
    meaning:
    'ไพ่ใบนี้จะหมายถึง ความกดดัน ความเครียด ที่ทำให้คุณนอนไม่หลับ ไพ่ใบนี้จึงเหมือนออกมาเตือนว่า คุณคิดมาก เครียดหรือกดดันมากไปรึเปล่า ลองดึงดาบทั้ง 9 ออกแล้วคิดตัดสินใจสิ่งต่างๆให้ดีด้วยเหตุผล และมองหาทางแก้ปัญหาจะดีกว่า',
    love:
    'ความคิดมาก คิดเยอะ กังวล ไปกับความรักค่อนข้างมาก เป็นความสัมพันธ์ที่ทำให้คุณรู้สึกว่า คุณกังวล ระแวง คิดมาก ตลอดเวลาจนอาจถึงขั้นทำให้นอนไม่หลับ แต่ไพ่ใบนี้เป็นไพ่ ความคิด บางทีเรื่องยังไม่เกิด ยังไม่มีอะไร คุณก็ระแวง และคิดมากไปก่อน',
    image: '9.png',
    name: 'NINE OF SWORDS',
  ),
  cardTarotsSword(
    meaning:
    'ไพ่ใบนี้นอกจากจะคิดมากจนคิดต่อไปไม่ไหว หรือหยุดคิดเรื่องนี้แล้ว ยังมีมุมดีของมันคือ การที่จะมีอนาคตข้างหน้าที่สดใสกำลังรออยู่ เหมือนแสงที่ส่องมาจากปลายฟ้า เหมือนหากเราหยุดคิด หยุดเครียด เราจะได้พบหนทางที่สดใสขึ้น พบวิธีแก้ปัญหาที่เข้ามารุมเร้าได้',
    love:
    'ไพ่ใบนี้ในความหมายเรื่องความรักค่อนข้างจะเป็น ความหมายในเชิงลบ คือความสัมพันธ์ที่มาถึงจุดจบ ความสัมพันธ์ที่ไปต่อไม่ได้ อาจหมายถึงการเลิกลาได้',
    image: '10.png',
    name: 'TEN OF SWORDS',
  ),
  cardTarotsSword(
    meaning:
    'ความคิดอยู่ในช่วงที่มีการเปลี่ยนแปลง ที่อาจรวมไปถึง การคิดให้รอบคอบ การสงสัย การเริ่มต้นการติดต่อสื่อสาร รวมถึงการเริ่มต้นคิดวิเคราะห์สิ่งใหม่ๆ',
    love:
    'เป็นไพ่ที่แสดงถึงความสงสัยและพูดคุยกันเพื่อเคลียร์กันซะมากกว่า ไพ่ใบนี้อาจดูไม่ค่อยดีในสถานการณ์ที่ไม่ได้หวานแหวว แต่มองในอีกมุมก็ถือว่าเป็นไพ่ที่แสดงถึงการเคลียร์ข้อสงสัย ที่ค้างคาใจกัน ให้เข้าใจกันมากขึ้น',
    image: '11.png',
    name: 'PAGE OF SWORDS',
  ),
  cardTarotsSword(
    meaning:
    'เราพร้อมตะลุย ฝ่าฟันอุปสรรค เพื่อให้ไปถึงเป้าหมายที่เราคิด และตั้งใจไว้ หรืออาจหมายถึงการฝ่าฟันปัญหา เรื่องที่ไม่เข้าใจกัน จะมีการพูดคุย ถกเถียง ทะเลาะกันได้ เพื่อให้ทุกอย่างกระจ่างขึ้น และอาจหมายถึงการได้พบเจอคนที่มีลักษณะนิสัยเป็นอัศวินดาบดังที่กล่าวมา',
    love:
    'หมายถึงความสัมพันธ์ที่พร้อมจะลุยฝ่าฟัน แม้มีอุปสรรค ก็พร้อมจะลุยกันไปด้วยดี หรือ หากเป็นความสัมพันธ์ที่มีปัญหามาก่อน มีเรื่องไม่เข้าใจกัน การที่มีการถกเถียงทะเลาะกัน เพื่อให้ได้ความชัดเจนกันทั้งสองฝ่าย',
    image: '12.png',
    name: 'KNIGHT OF SWORDS',
  ),
  cardTarotsSword(
    meaning:
    'ส่วนไพ่ราชินีที่มีสัญลักษณ์ของ ธาตุน้ำ คือเป็นผู้ที่ขับเคลื่อนด้วยอารมณ์ภายใน มีความละเอียดอ่อน นึกถึงจิตใจผู้อื่น ถือดาบซึ่งเป็นสัญลักษณ์ของ ธาตุลม แสดงถึงความคิด ตรรกะ เหตุผล และความรวดเร็ว เป็นผู้หญิงที่เป็นคนมีเหตุผลสูง ผู้หญิงที่มีความเป็นผู้นำ มีความโดดเดี่ยว',
    love:
    'ไพ่ราชินี มักเป็นตัวแทนของ ผู้หญิง ถ้าถามถึงว่าผู้หญิงคนนี้คิดอย่างไรกับคุณ หรือคิดยังไงกับความสัมพันธ์ ก็ตอบได้เลยว่า เธอเป็นคนที่เด็ดเดี่ยว โดดเดี่ยว ถ้าใน กรณีที่โสด ก็ตอบได้เลยว่า เธอ ไม่พร้อมจะมีใคร',
    image: '13.png',
    name: 'QUEEN OF SWORDS',
  ),
  cardTarotsSword(
    meaning:
    'ไพ่ราชาเป็นไพ่ธาตุลม ซึ่งหมายถึงความคิด มีตรรกะ มีความเป็นผู้ใหญ่ มีเหตุผลชัดเจน เมื่อเป็นไพ่ดาบด้วยแล้ว ยิ่งเป็นคนที่มีความคิดที่ชัดเจนมากยิ่งขึ้น จนอาจเรียกได้ว่า เป็นคนคิดมากคิดเยอะ มีเหตุผลสุดๆ เป็นราชาแห่งการคิด',
    love:
    'ความสัมพันธ์ความรักของไพ่ใบนี้ ต้องบอกว่าเป็นความสัมพันธ์ที่ค่อนข้างจะคบกันด้วยเหตุและผล หากมีปัญหาอะไรกันก็คุยกันรู้เรื่อง พูดคุยกันง่ายไม่ใช้อารมณ์มาตัดสิน',
    image: '14.png',
    name: 'KING OF SWORDS',
  ),
];
class _cardSwordState extends State<cardSword> {
  late int _position;
  void initState() {
    super.initState();
    _position = widget.position;
    print('position $_position');
  }
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title:Text(''),
        backgroundColor: Colors.orangeAccent,),
      body: Stack(
        children: [
          Container(
            decoration: BoxDecoration(
              image: DecorationImage(
                image: AssetImage("assets/images/bg/prm2.jpg"),
                fit: BoxFit.cover,
              ),
            ),
            child: null /* add child content here */,
          ),
          Center(
            child: FlipCard(
              direction: FlipDirection.HORIZONTAL,
              front: Image.asset(
                'assets/images/cards/ไพ่ดาบ/${cardsSword[_position].image}',
                width: 230,
                height: 400,
                fit: BoxFit.contain,

              ),
              back: Container(
                width: 230,
                height: 400,
                color: Colors.white,
                child: Padding(
                  padding: const EdgeInsets.all(10.0),
                  child: Column(
                    children: [
                      Container(
                        decoration: BoxDecoration(
                          image: DecorationImage(
                            image: AssetImage("assets/images/bg/prm2.jpg"),
                            fit: BoxFit.cover,
                          ),
                        ),
                      ),
                      Padding(
                        padding: const EdgeInsets.all(8.0),
                        child: Text("${cardsSword[_position].name}",style: TextStyle(fontWeight: FontWeight.bold, fontSize: 15,color: Colors.black), textAlign: TextAlign.center),
                      ),

                      Padding(
                        padding: const EdgeInsets.all(4.0),
                        child: Text('ความหมายไพ่'
                            ,style: TextStyle(fontWeight: FontWeight.bold,fontSize: 13,color: Colors.black), textAlign: TextAlign.start),
                      ),
                      Text('${cardsSword[_position].meaning}'
                          ,style: TextStyle(fontSize: 13,color: Colors.black)),
                      Padding(
                        padding: const EdgeInsets.all(4.0),
                        child: Text('ด้านความรัก'
                            ,style: TextStyle(fontWeight: FontWeight.bold,fontSize: 13,color: Colors.black), textAlign: TextAlign.start),
                      ),
                      Text('${cardsSword[_position].love}'
                          ,style: TextStyle(fontSize: 13,color: Colors.black)),

                    ],
                  ),
                ),
              ),
            ),
          ),


        ],
      ),
    );
  }
}
