import 'package:flip_card/flip_card.dart';
import 'package:flutter/material.dart';

import '../../model/cardTarotsCup.dart';

class cardCup extends StatefulWidget {
  final position;
  const cardCup({Key? key, required this.position}) : super(key: key);

  @override
  _cardCupState createState() => _cardCupState();
}

final List<cardTarotsCup> cardsCup= [
  cardTarotsCup(
    meaning:
    'มีโอกาสที่จะได้ประสบพบเจอ คน หรือเหตุการณ์ที่ทำให้เราได้รับความรู้สึกใหม่ๆ เช่น ความรัก ความตื่นเต้น รวมไปถึงความเศร้าและเสียใจ แต่ไพ่ใบนี้ยังหมายถึงความคิดที่สร้างสรรค์ใหม่ๆในเชิง ศิลปะ ที่ใช้อารมณ์ เช่น บทเพลง บทกวี ได้อีกด้วย',
    love:
    'โอกาสที่จะได้เจอความรักใหม่ ถ้ามีคนรักอยู่แล้วก็หมายถึงความรักที่ชื่นมื่น อะไรที่ขาดหายไปก็อาจจะได้มีโอกาสอีกครั้ง เช่น จะมีเซอร์ไพรซ์ หรือมีสิ่งต่างๆที่ทำให้รู้สึกโรแมนติก และรักกันเหมือนครั้งแรกที่เจอ',
    image: '1.png',
    name: 'ACE OF CUPS',
  ),
  cardTarotsCup(
    meaning:
    'ไพ่ใบนี้เหมือนความเข้ากันได้ของคนสองคน การแลกเปลี่ยนอารมณ์ความรู้สึกกันได้อย่างลงตัว มีความเข้าใจ ความรู้สึกดี เรื่องการงาน การเงิน คุณโอเคกับเรื่องต่างๆ ไม่ว่าจะเรื่องการทำงาน หรือความสัมพันธ์กับเพื่อนร่วมงาน',
    love:
    'ถ้าเป็นคู่รักกันแล้ว รักกันดีมาก หากมีปัญหาก็สามารถข้ามผ่านไปได้ด้วยความเข้าใจ หากเป็นคนโสดหรือคนคุยที่กำลังคุยกัน หรือถามว่าเค้ารู้สึกยังไง ก็ต้องบอกได้ว่าต่างฝ่ายต่างรักกัน มีช่วงเวลาดีๆให้แก่กัน',
    image: '2.png',
    name: 'TWO OF CUPS',
  ),
  cardTarotsCup(
    meaning:
    'ความหมายของไพ่ใบนี้จึงหมายถึงเรื่อง เพื่อน เป็นส่วนใหญ่ การได้พบปะ สังสรรค์ กับเพื่อนฝูง ถ้ามองเป็นเรื่องอื่นๆ ก็จะมีคีย์เวิร์ด ที่เรื่อง เพื่อน ความเข้าใจกัน ความสุขหลังจากได้ร่วมงานกัน',
    love:
    'ความรักมีแนวโน้มที่จะพัฒนาไปในทางที่ดีแต่ไพ่ค่อนข้างออกไปในทางแนวเพื่อนมากกว่า ดังนั้นหากถามว่าเค้าคิดยังไงกับเราก็จะตอบไปในแนวเค้าก็เข้ากับเราได้ดี ชื่นชอบเรา แต่เป็นเพื่อนกันไปก่อนน่าจะดีกว่า',
    image: '3.png',
    name: 'THREE OF CUPS',
  ),
  cardTarotsCup(
    meaning:
    'มองในความหมายโดยรวมไพ่ใบนี้เหมือน มีสิ่งที่ลังเล สิ่งที่ทำให้รู้สึกยังไม่พร้อม ยังไม่โอเค ที่จะรับโอกาสใหม่ๆได้ อาจเป็นได้จากประสบการณ์ความรู้ที่ผ่านมา ที่ทำให้คนที่ได้ไพ่ใบนี้ไม่พร้อมรับโอกาสใหม่ๆ',
    love:
    'คนที่ได้รับไพ่ใบนี้จะเป็นคนที่กำลังเบื่อหนายในความรัก รู้สึกว่าความรักที่เข้ามาหรือความรักที่มีอยู่มันไม่ใช่ แม้จะมีตัวเลือกเข้ามา หรือมีคนเข้ามาจีบ ก็ยังไม่คิดที่จะรับรักใครง่ายๆ ถ้าเป็นคนโสดต้องบอกได้เลยว่าคนคนนี้ไม่สนใจความรักที่ได้รับ อาจเพราะอะไรก็แล้วแต่ ทำให้เค้าไม่อยากจะรับรักใคร',
    image: '4.png',
    name: 'FOUR OF CUPS',
  ),
  cardTarotsCup(
    meaning:
    'คนที่ได้ไพ่ใบนี้อาจจะพบการสูญเสียที่ทำให้รู้สึกเสียใจ ไม่ว่าจะเรื่องเงิน เรื่องงาน ความรัก หรืออะไรก็ตาม และไม่เปิดใจที่จะเดินหน้าต่อไป แม้โอกาสจะมีเข้ามาก็ตาม',
    love:
    'มักจะเป็นคนที่ไม่สามารถลืมอดีตได้ ไม่สามารถลืมความผิดพลาดและให้อภัยตัวเอง ในอดีตที่ทำพลาดไปได้ สิ่งนี้ทำให้คนๆนี้ไม่สามารถเริ่มต้นกับความรักใหม่ๆ หรือกล้าที่จะตัดสินใจทำอะไรใหม่ๆได้',
    image: '5.png',
    name: 'FIVE OF CUPS',
  ),
  cardTarotsCup(
    meaning:
    'ไพ่ใบนี้ตีความได้หลายหลาย ด้วยคีย์เวิร์ด ความรู้สึกเก่าๆ มันเป็นความรู้สึกดีๆ เช่น การได้นึกถึงวันเก่าๆ กลับบ้านเกิด การได้เจอพบปะเพื่อนเก่า และไพ่ใบนี้ยังหมายถึงการได้รับของขวัญจากคนที่รู้จักกันมาก่อนอีกด้วย',
    love:
    'ในมุมมองความรัก ก็หมายถึง ความรู้สึกเก่าๆกำลังจะกลับมาเช่นกัน โดยมากเป็นความรู้สึกที่ดี เช่น คุณจะได้เจอเพื่อนเก่า เจอคนรู้จักเก่าๆที่อาจทำให้คุณรู้สึกดี การได้เจอแฟนเก่าที่ไม่ว่าจะเลิกลากันไปดีร้ายยังไง',
    image: '6.png',
    name: 'SIX OF CUPS',
  ),
  cardTarotsCup(
    meaning:
    'หมายความว่า คุณคิด คุณฝัน ทางเลือกมากมายเอาไว้ แต่คุณก็ยังไม่เลือก ยังไม่ลงมือทำ มันถึงเวลาที่คุณจะต้องเลือก ต้องลงมือทำเปลี่ยนความคิดความคิดให้เป็นความจริง หากเป็นเรื่องการงาน เงิน ก็ดูเป็นการตัดสินใจเรื่องงาน เงินที่ตัดสินใจไม่ได้',
    love:
    'คนที่ได้ไพ่ใบนี้ดูมีทางเลือก ดูมีคนคุยหลายคน แล้วก็ยังเลือกไม่ได้ ตัดสินใจไม่ได้ที่จะเลือกใคร แต่ละคนก็มีข้อดี',
    image: '7.png',
    name: 'SEVEN OF CUPS',
  ),
  cardTarotsCup(
    meaning:
    'ไพ่ใบนี้มีความหมาย หมายถึงการเดินออกจากปัญหา จากสิ่งและอารมณ์ที่รบกวนจิตใจเราให้ขุ่นมัว ถ้วยก็คืออารมณ์ ถ้าหากสิ่งไหนที่ไม่โอเค ทำให้อารมณ์เราไม่โอเค ทำให้คุณรู้สึกเศร้าหมอง คุณก็พร้อมที่จะทิ้งมันไว้ แล้วเดินจากไปอย่างสงบ',
    love:
    'ทิ้งและเดินจากอะไรที่ไม่ดี ความสัมพันธ์ที่ไม่ดี ความรักที่ทำให้เราผิดหวัง รู้สึกแย่ ก็เดินจากไป ไพ่ใบนี้อาจไม่ได้หมายถึงการเลิกกันชัดเจน แต่ก็อาจหมายถึงการเลิกกันชั่วคราวหรือพัก',
    image: '8.png',
    name: 'EIGHT OF CUPS',
  ),
  cardTarotsCup(
    meaning:
    'หมายความว่า การพอใจ การได้รับการเติมเต็มในสิ่งที่ต้องการ ความหมายอีกอย่างจึงเหมือนกับว่า มีความสุข มีความพอใจ มั่นใจเกินเหตุ เกินความเป็นจริง เหมือนมีแค่ 9 ถ้วยก็อวดแล้ว ซึ่งมันก็รวมไปถึงการหลงตัวเองได้อีกด้วย',
    love:
    'ไพ่ใบนี้โดยรวมก็มี ความสุขดี พอใจ ในความสัมพันธ์ กรณีโสดเรียกได้ว่า พอใจที่จะโสด กรณีคบกันหรือกำลังคุยๆกันอยู่ก็จะหมายความว่า คนๆนี้ค่อนข้างจะโอเคและมีความสุขกับความสัมพันธ์นี้',
    image: '9.png',
    name: 'NINE OF CUPS',
  ),
  cardTarotsCup(
    meaning:
    'ไพ่ใบนี้ไม่ว่าเรื่องไหนก็ดูจะสุขสมหวังไปหมด ทุกอย่างดูราบรื่น มีความสุข อะไรๆก็เข้ากันได้ไปหมด ซึ่งไพ่ใบนี้เนื่องจากเป็นทางด้านอารมณ์ แม้ภายนอกทางกายภาพเช่น เรื่องเงิน หรือเรื่องงานอาจจะมีปัญหาบ้าง แต่ถ้าคุณมีความสุขอย่างมาก',
    love:
    'ไพ่ใบนี้ก็หมายถึงคุณมีความสุขกับคนรัก คนที่คุณรัก ทุกอย่างเข้ากันได้ดี สามารถวาดฝันถึงอนาคตไปถึงการสร้างครอบครัวได้ เรียกได้ว่า ทั้งคู่เติมซึ่งกันและกันจนเต็ม',
    image: '10.png',
    name: 'TEN OF CUPS',
  ),
  cardTarotsCup(
    meaning:
    'ไพ่ใบนี้ความหมายจึงเน้นไปที่เรื่อง อารมณ์ การเปลี่ยนแปลงไปสู่สิ่งใหม่ ถือเป็นไพ่ที่ดี ที่ทำให้เราอารมณ์ดีได้ครับ รวมถึงการได้พบเจอคนที่มีความคิดที่เด็กกว่า มีความคิดสร้างสรรค์ อาจหมายถึงการได้รับข่าวสารที่ดีที่ทำให้อารมณ์เราดีขึ้นได้ครับ',
    love:
    'เป็นไพ่ที่บ่งบอกถึงการเปลี่ยนแปลง เปลี่ยนสถานะความสัมพันธ์ ไปอีกระดับนึง',
    image: '11.png',
    name: 'PAGE OF CUPS',
  ),
  cardTarotsCup(
    meaning:
    'ไพ่ใบนี้จึงหมายถึง คนที่เลือกเดินหน้าไปตามเส้นทางที่หัวใจและตัวเองต้องการ โดยเป้าหมายการเดินทาง หรือการกระทำในครั้งนี้ จะนำพามาซึ่งความรู้สึกที่ดี การเงิน อาจเป็นไพ่ที่ไม่ได้บอกว่าการงาน การเงินจะดีนัก แต่เป็นไพ่ที่บอกว่า เรารู้สึกดีกับสิ่งที่จะเกิด',
    love:
    ' ค่อนข้างไปในทางที่ดี เป็นการพัฒนาความรัก ความสัมพันธ์ ไปข้างหน้าอย่างมีความสุข และโรแมนติก',
    image: '12.png',
    name: 'KNIGHT OF CUPS',
  ),
  cardTarotsCup(
    meaning:
    'หมายถึงผู้หญิงที่มีสเน่ห์ มีความเป็นแม่ที่เด่นในเรื่องความรู้สึก เข้าอกเข้าใจความรู้สึก และอารมณ์ทั้งของตัวเองและผู้อื่นได้ดี เป็นคนอ่อนโยน และอ่อนไหวได้ง่าย เป็นคนที่มีเซนส์ดี คาดเดาสิ่งๆต่างๆได้ถูกต้อง นอกจากนี้ยังแปลได้ถึงผู้หญิงที่อยู่ในช่วงนั้นของเดือนได้อีกด้วย',
    love:
    'ความสัมพันธ์มีความเข้าอกเข้าใจ ความรู้สึกของกันและกันอย่างดี รักกันมากและราบรื่น',
    image: '13.png',
    name: 'QUEEN OF CUPS',
  ),
  cardTarotsCup(
    meaning:
    'ความหมายของไพ่ใบนี้ ไม่ว่าจะเรื่องงานเรื่องเงินจะหมายถึงความสมดุลทางความรู้สึกและความคิด ทุกอย่างเลยดูราบรื่น ไม่มีปัญหาอะไรเข้ามาให้หม่นหมองใจและเครียด ไพ่ใบนี้ยังหมายถึง การได้พบชายที่มีความเป็นผู้ใหญ่ที่ใจดี เข้าอกเข้าใจผู้อื่นและมีเหตุผล',
    love:
    'ในด้านความรัก หากได้ไพ่ใบนี้ ความหมายจะออกแนว เรื่อยๆ โอเค ราบรื่น ปัญหาที่เข้ามาก็สามารถควบคุมและจัดการให้ผ่านไปได้ด้วยดี อารมณ์รุนแรง ดราม่าจะไม่เกิดในความสัมพันธ์',
    image: '14.png',
    name: 'KING OF CUPS',
  ),
];

class _cardCupState extends State<cardCup> {
  late int _position;
  void initState() {
    super.initState();
    _position = widget.position;
    print('position $_position');
  }
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title:Text(''),
        backgroundColor: Colors.orangeAccent,),
      body: Stack(
        children: [
          Container(
            decoration: BoxDecoration(
              image: DecorationImage(
                image: AssetImage("assets/images/bg/prm2.jpg"),
                fit: BoxFit.cover,
              ),
            ),
            child: null /* add child content here */,
          ),
          Center(
            child: FlipCard(
              direction: FlipDirection.HORIZONTAL,
              front: Image.asset(
                'assets/images/cards/ไพ่ถ้วย/${cardsCup[_position].image}',
                width: 230,
                height: 400,
                fit: BoxFit.contain,

              ),
              back: Container(
                width: 230,
                height: 400,
                color: Colors.white,
                child: Padding(
                  padding: const EdgeInsets.all(10.0),
                  child: Column(
                    children: [
                      Container(
                        decoration: BoxDecoration(
                          image: DecorationImage(
                            image: AssetImage("assets/images/bg/prm2.jpg"),
                            fit: BoxFit.cover,
                          ),
                        ),
                      ),
                      Padding(
                        padding: const EdgeInsets.all(8.0),
                        child: Text("${cardsCup[_position].name}",style: TextStyle(fontWeight: FontWeight.bold, fontSize: 15,color: Colors.black), textAlign: TextAlign.center),
                      ),

                      Padding(
                        padding: const EdgeInsets.all(4.0),
                        child: Text('ความหมายไพ่'
                            ,style: TextStyle(fontWeight: FontWeight.bold,fontSize: 13,color: Colors.black), textAlign: TextAlign.start),
                      ),
                      Text('${cardsCup[_position].meaning}'
                          ,style: TextStyle(fontSize: 13,color: Colors.black)),
                      Padding(
                        padding: const EdgeInsets.all(4.0),
                        child: Text('ด้านความรัก'
                            ,style: TextStyle(fontWeight: FontWeight.bold,fontSize: 13,color: Colors.black), textAlign: TextAlign.start),
                      ),
                      Text('${cardsCup[_position].love}'
                          ,style: TextStyle(fontSize: 13,color: Colors.black)),

                    ],
                  ),
                ),
              ),
            ),
          ),


        ],
      ),
    );
  }
}
