import 'dart:math';

import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';

import '../../model/cardTarots22.dart';
import '../../model/cardTarotsCoin.dart';
import '../../model/cardTarotsCup.dart';
import '../../model/cardTarotsSword.dart';
import '../../model/cardTarotsWood.dart';
import 'cardCoin.dart';
import 'cardCup.dart';
import 'cardSword.dart';
import 'cardTarot.dart';
import 'cardWood.dart';

class pickCards extends StatefulWidget {
  static const routeName = "/testing-page";

  @override
  _pickCardsState createState() => _pickCardsState();
}
class _pickCardsState extends State<pickCards> {
  int selectedIndex = -1;
  Random random = new Random();
  late final List<int> number = [random.nextInt(22)+1, random.nextInt(14)+1, random.nextInt(14)+1, random.nextInt(14)+1, random.nextInt(14)+1];

  final List<cardTarotsCoin> cardsCoin = [
    cardTarotsCoin(
      meaning:
      'จะได้รับการเริ่มต้นใหม่ที่มีโอกาสที่ดีในอนาคต ด้รับโอกาสใหม่ๆที่เป็นโอกาสที่สามารถพัฒนาให้มั่นคง ลงทุนอะไรก็จะได้รับผลตอบแทน',
      love:
      'ความสัมพันธ์อยู่ในระยะเริ่มต้นที่ไปในทิศทางที่ดีและถูกต้อง ถึงจะยังไม่ใช่จุดที่จะลงตัวเป็นแฟนกัน แต่เรียกได้ว่าเป็นการเริ่มต้นที่ดี มีโอกาสพัฒนาไปในทางที่ดี ในอีกมุมมองคือคนที่เข้ามาหาเรา อาจจะพร้อมที่จะ ช่วยเหลือเราในด้านการเงิน',
      image: '1.png',
      name: 'ACE OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'การจัดการเรื่องค่าใช้จ่าย การหมุนเงิน การจ่ายหนี้ ยังสมดุล มีเงินใช้หมุนเวียนได้เรื่อยๆไม่ติดขัด',
      love:
      'คนโสด ต้องจัดการความสัมพันธ์ให้ราบรื่นทุกคน หรืออาจหมายถึงว่า เรามีสิ่งสำคัญอื่นๆที่เราต้องให้เวลาและความสำคัญ เช่น การให้เวลากับเพื่อน ครอบครัว งาน งานอดิเรก ส่วนคนมีคู่ ต้องพยายามจัดการให้เวลากับความรัก การงาน เพื่อน ครอบครัว ที่สิ่งที่เราคิดว่าสำคัญ ให้ลงตัว สมดุล ไม่ทำให้อะไรขาด หรือเสียไป',
      image: '2.png',
      name: 'TWO OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ไพ่นี้หมายถึง การส่งสิ่งที่เราสร้างขึ้นมาออกไป เช่น การส่งงาน ส่งของ ส่งความรัก การรอผลลัพธ์ที่ส่งออกไปกลับมา โดยที่ก็ไม่รู้ว่าผลลัพธ์จะดีหรือไม่',
      love:
      'มีการริเริ่มที่จะวางแผน อนาคตที่มั่งคั่ง การคุยหารือ กันอย่างจริงจังในอนาคต เช่น เรื่องการเงิน การทำงาน การมีลูก การแบ่งหน้าที่ เป็นต้น หรือบางทีอาจจะคุยปรึกษาหารือกันว่าจะเอายังไงกับความสัมพันธ์นี้ ถ้ามันไม่ดีเราจะปรับแก้ไขอย่างไร',
      image: '3.png',
      name: 'THREE OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ไพ่ของไม้ทั้งสี่ไม้เปรียบเสมือนความมั่นคง บ้านที่สร้างได้สำเร็จ และมีชายหญิงคู่หนึ่งที่เฉลิมฉลองกัน ในงานเลี้ยงที่คนมาร่วมงานมากมาย เป็นดั่งงานแต่งงานที่มีความสุข ไพ่ใบนี้จึงหมายถึง การเฉลิมฉลอง งานแต่งงาน ความรัก เพื่อน ครอบครัว',
      love:
      'โดยปกติเป็นไพ่ที่ดีในด้านความรัก หมายถึงความรักที่สุกงอม มีการเฉลิมฉลอง อบอุ่น รวมถึความรักนี้ ในมุมมองครอบครัว เพื่อน ก็ยอมรับ มีความสุขกันอย่างดี',
      image: '4.png',
      name: 'FOUR OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'เด็ก 5 คน กำลังทำการต่อเติมไม้ที่ถือไว้ ทุกคนพยายามที่จะปักไม้ของตัวเองลงและประกอบเข้าด้วยกันให้ลงตัว แต่ก็ยังยุ่งเหยิงเพราะแต่ละคนไม่เข้าใจกัน ไพ่ใบนี้จึงหมายถึง การถกเถียง การประชุม วางแผน ความขัดแย้ง แข่งขัน',
      love:
      'หมายถึงการขัดแย้งในแนวคิด หรืออะไรต่างๆ ที่จะวางแผนด้วยกัน มีความขัดแย้งกันไม่ลงตัว ต่างฝ่ายต่างไม่ยอมกัน ก็เลยอาจจะทะเลาะกันบ้าง',
      image: '5.png',
      name: 'FIVE  OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ชายนายทหารผู้ได้รับชัยชนะ เดินทางกลับมายังเมือง โดยมีผู้คนมาร่วมสรรเสริญและแสดงความยินดีอยู่รอบข้าง ไพ่ใบนี้จึงหมายถึง การมีความคืบหน้า การได้รับชัยชนะ การจบปัญหาด้วยดี มีความมั่นใจ เชื่อมั่นในตัวเอง',
      love:
      'ความรักกับไพ่ใบนี้นั้น ก็เรียกได้ว่าเป็นความรักที่ดี ความรักมีความก้าวหน้า ความสัมพันธ์มีความเดินหน้าไปในทิศทางที่ดีขึ้น ถ้าหากความสัมพันธ์มีปัญหามาก่อนก็จะได้รับการแก้ไขไปอย่างดี',
      image: '6.png',
      name: 'SIX OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ความหมายไพ่ใบนี้จึงหมายถึงการ รักษาตำแหน่ง รักษาสิ่งที่เราคิดว่าถูก รักษาสิทธิ์ที่เป็นของเรา ต่อสู้กับปัญหาต่างๆที่เข้ามา จากสิ่งที่เราอาจจะยังไม่รู้ชัดว่าคืออะไร บางทีเราอาจจะคิดมากไปเองหรือกังวลเกินไป',
      love:
      'ความสัมพันธ์เหมือนมีอุปสรรคเข้ามา หรือแม้แต่ปัญหาภายใน เรื่องการที่อีกฝ่ายทำร้ายจิตใจคุณ ให้คุณต้องต่อสู้ฝ่าฟันเพื่อรักษาความสัมพันธ์ให้คงอยู่ต่อไป และอาจหมายถึงการต่อสู้เพื่อรักษาตัวตนของตัวเองในความสัมพันธ์ได้ด้วย',
      image: '7.png',
      name: 'SEVEN OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ไพ่ใบนี้แปลได้ว่า จะมีการเปลี่ยนแปลง มีเรื่องเข้ามากระทันหัน รวดเร็ว จนคุณตั้งตัวไม่ทัน ส่วนใหญ่จะแปลไปในทางที่ดี',
      love:
      'ความสัมพันธ์เป็นไปอย่างรวดเร็ว ความรักพัฒนาไปอย่างรวดเร็ว มีความคืบหน้า มีเรื่องเซอร์ไพรซ์ หากเป็นโสดก็มีความเป็นไปได้ถึงการที่มีคนเข้ามาทำให้ชอบ ทำให้รักอย่างรวดเร็ว ไม่ทันตั้งตัว',
      image: '8.png',
      name: 'EIGHT OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ทุกครั้งที่ผิดพลาดล้มเหลว ชายในไพ่ใบนี้จะได้รับบาดแผลแต่ก็ทำให้เค้าได้ประสบการณ์ความรู้ ไพ่ใบนี้จึงแปลได้ถึง การทำงานที่มีประสบการณ์ เพราะที่ผ่านมาอาจจะหนัก และล้มเหลวมาแล้ว จนทำให้รู้ถึงปัญหาและวิธีแก้ไขได้',
      love:
      'ความสัมพันธ์ที่เรียกได้ว่า เจ็บมาเยอะ จนทำให้มีประสบการณ์มามาก และทำให้มีรู้วิธีในการแก้ไขปัญหาความสัมพันธ์ต่างๆ ที่เข้ามา ได้อย่างดี ไพ่ใบนี้ในมุมมองหลักๆจึงเป็นความหมายที่ดี ที่สามารถดำเนินความสัมพันธ์ต่อไปได้ เพราะเรามีประสบการณ์ที่จะจัดการ',
      image: '9.png',
      name: 'NINE OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ไพ่ใบนี้แปลได้เลยว่าหมายถึง งานที่ครบ งานที่เต็ม ความปรารถนาความต้องการที่เต็มเปี่ยม แต่จาก ไพ่จะเห็นว่ามันยังไม่ถึงจุดสิ้นสุด ถึงแม้จะใกล้แล้วก็ตาม ดังนั้นสิ่งที่เราทำคือการ แบกรับ มันไว้ เพื่อให้ไปถึงจุดหมายที่เราตั้งเป้าไว้ อาจหมายถึงงานที่หนัก ภาระในจิตใจที่หนักอึ้ง แต่เราก็ยังคงเดินหน้าต่อไปยังเป้าหมายได้',
      love:
      'ถึงไพ่หมายเลข 10 จะหมายถึงการครบ จบสมบูรณ์ แต่ไพ่ใบนี้นั้นยังไม่ค่อยสมบูรณ์เท่าไหร่ ไพ่ใบนี้จะหมายถึงความสัมพันธ์ที่หนักอึ้ง อาจเป็นภาระด้านอื่นๆ เช่น เรื่องงาน เงิน ครอบครัว ที่อาจไม่เห็นด้วย',
      image: '10.png',
      name: 'TEN OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ไพ่ใบนี้จึงหมายถึงการเปลี่ยนแปลงหรือการเริ่มพัฒนา เริ่มต้น สิ่งใหม่ๆที่มีแรงผลักดัน มีแรงบันดาลใจ เช่น การผจญภัย การทำงานใหม่ทีท้าทายขึ้น และเราก็พร้อมที่จะลุยไป',
      love:
      'ความรักความสัมพันธ์ของไพ่ใบนี้ มักแปลถึงการเริ่มต้น การเปลี่ยนแปลง ความต้องการในการพัฒนาความสัมพันธ์ เป็นการเริ่มความรักที่ค่อนข้างจะรุนแรง หรือวัยรุ่นซะหน่อย คือมีความรักที่มาก เป็นความรักที่เหมือนการผจญภัย มีเรื่องน่าตื่นเต้นหวือหวาตลอดเวลา',
      image: '11.png',
      name: 'PAGE OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'ความหมายคือ การเดินหน้า ลุยทำในสิ่งที่ใจต้องการ จนบางทีอาจจะเป็นพวกรีบร้อน ทำอะไรโดยไม่คิดให้รอบคอบได้ อาจจะหมายถึงการที่ตะลุยทำงานอย่างมุ่งมั่น ตั้งใจ ด้วยพลังงานที่เปี่ยมล้น แต่ต้องระวังเรื่องความสะเพร่าด้วยเช่นกัน',
      love:
      'ไพ่ใบนี้หมายถึงความสัมพันธ์ที่เดินหน้าไปด้วยความรวดเร็ว ไปเร็วด้วยความต้องการ มีพลังพร้อมจะฝ่าฟันอุปสรรค มองในแง่ดีก็ถือว่าดี แต่เรื่องความรัก บางทีก็อาจจะขาดความรอบคอบไปซะหน่อย จนอาจจะทำให้ความสัมพันธ์ไม่ยืดยาวหรือยั่งยืนนัก',
      image: '12.png',
      name: 'KNIGHT OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'คนที่ได้ไพ่ใบนี้ (โดยเฉพาะผู้หญิง) เป็นคนที่มีความมั่นใจ สดใส มีความมุ่งมั่นสูง มีความฝัน ชอบปาร์ตี้สังสรรค์และทำงานเก่ง จู้จี้จุกจิก ถ้าหากได้ไพ่ใบนี้ขึ้นมา ก็อาจจะหมายถึงการที่จะได้พบ ผู้หญิงที่มีลักษณะแบบที่กล่าวมา เข้ามาในสถานการณ์ของคุณ',
      love:
      'ไพ่ราชินีไม้เป็นลักษณะของผู้หญิงที่มีสเน่ห์ มีความมุ่งมั่น ในการทำงาน ความฝัน และมีความเฟรนลี่ เพื่อนเยอะ ชอบสังคม ทำให้ดึงดูดคนเข้ามามากมาย แต่ถ้าโสดอยู่ ก็จะตอบได้ว่าผู้หญิงคนนี้ยังไม่คิดที่จะลงเอยกับใคร เพราะเธอค่อนข้างจะสามารถอยู่ตัวคนเดียวได้ พึ่งพาตัวเองได้',
      image: '13.png',
      name: 'QUEEN OF PENTACLES',
    ),
    cardTarotsCoin(
      meaning:
      'คนที่ได้ไพ่ใบนี้จึงเป็นคนที่ค่อนข้างกระตือรือร้น มีแรงผลักดัน เพื่อให้ได้ในสิ่งที่ตัวเองต้องการ และเนื่องจากมีความเป็นผู้ใหญ่จากการเป็นราชา ไพ่ไม้เน้นไปที่เรื่องงาน ถ้าได้ใบนี้ก็เรียกได้ว่า อาจจะได้ทำงานเป็นหัวหน้า หรือเป็นคนที่เก่งในเรื่องงาน เป็นผู้นำในการทำงานได้อย่างดี',
      love:
      'ไพ่ใบนี้อาจจะเรียกได้ว่าเป็นความสัมพันธ์ที่มีพลังงาน มีแรงผลักดันในการพากันไปในเป้าหมายของความรักที่ต้องการได้  นอกจากนี้ยังหมายถึงความรักที่ใช้ความปรารถนาเป็นตัวนำพาไปได้ด้วย',
      image: '14.png',
      name: 'KING OF PENTACLES',
    ),


  ];
  final List<cardTarotsWood> cardsWood = [
    cardTarotsWood(
      meaning:
      'หมายถึงการเริ่มต้นใหม่ การได้รับโอกาสด้านการงานใหม่ มีสิ่งใหม่ๆเข้ามา ไพ่ใบนี้จึงเหมือนจุดเริ่มต้นของสิ่งที่ร้อนแรง การงาน ความต้องการใหม่ๆ',
      love:
      'ในด้านความรัก ใบนี้ค่อนข้างจะดีทีเดียว หมายถึงการเริ่มต้นใหม่ ความรู้สึกใหม่ๆ ที่ทำให้เรารู้สึกดี หากถามว่าอีกฝ่ายรู้สึกยังไงแล้วไพ่ใบนี้แทนเค้า หรือไพ่ใบนี้ขึ้นแทนตัวเราในสถานการณ์ก็หมายถึงอารมณ์ที่รุนแรง เต็มไปด้วยพลัง ความชอบ ความรัก ที่พร้อมจะพุ่งชน พุ่งจีบ ทีเดียว  ',
      image: '1.png',
      name: 'ACE OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ไพ่ใบนี้หมายถึง การวางแผนอนาคต การมองถึงอนาคต ถึงจุดที่ต้องตัดสินใจเลือกเดิน',
      love:
      'ในมุมมองความรัก ไพ่ใบนี้ก็หมายถึง ความรักที่กำลังไปในทางที่ดี มีโอกาสในการพัฒนาที่ดี ไพ่ใบนี้นอกจากกรณีดังกล่าว ก็ยังมีกรณีที่หมายถึงการที่หมายถึงว่าเรายังไม่คิดที่จะมองใคร เรายังมองไปยังโลกกว้าง มองไปยังอนาคตที่ยังมาไม่ถึง คิดว่าน่าจะมีโอกาสในความรักที่ดีกว่านี้',
      image: '2.png',
      name: 'TWO OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ไพ่นี้หมายถึง การส่งสิ่งที่เราสร้างขึ้นมาออกไป เช่น การส่งงาน ส่งของ ส่งความรัก การรอผลลัพธ์ที่ส่งออกไปกลับมา โดยที่ก็ไม่รู้ว่าผลลัพธ์จะดีหรือไม่',
      love:
      'ในด้านความรัก ไพ่ใบนี้ก็ความหมายไม่ต่างกัน ในความสัมพันธ์ที่เป็นคนรักกันแล้ว ก็อาจจะอยู่ในช่วงห่างไกลกันต้องมีคนที่รอคอยคนนึงเสมอ',
      image: '3.png',
      name: 'THREE OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ไพ่ของไม้ทั้งสี่ไม้เปรียบเสมือนความมั่นคง บ้านที่สร้างได้สำเร็จ และมีชายหญิงคู่หนึ่งที่เฉลิมฉลองกัน ในงานเลี้ยงที่คนมาร่วมงานมากมาย เป็นดั่งงานแต่งงานที่มีความสุข ไพ่ใบนี้จึงหมายถึง การเฉลิมฉลอง งานแต่งงาน ความรัก เพื่อน ครอบครัว',
      love:
      'โดยปกติเป็นไพ่ที่ดีในด้านความรัก หมายถึงความรักที่สุกงอม มีการเฉลิมฉลอง อบอุ่น รวมถึงความรักนี้ ในมุมมองครอบครัว เพื่อน ก็ยอมรับ มีความสุขกันอย่างดี',
      image: '4.png',
      name: 'FOUR OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'เด็ก 5 คน กำลังทำการต่อเติมไม้ที่ถือไว้ ทุกคนพยายามที่จะปักไม้ของตัวเองลงและประกอบเข้าด้วยกันให้ลงตัว แต่ก็ยังยุ่งเหยิงเพราะแต่ละคนไม่เข้าใจกัน ไพ่ใบนี้จึงหมายถึง การถกเถียง การประชุม วางแผน ความขัดแย้ง แข่งขัน',
      love:
      'หมายถึงการขัดแย้งในแนวคิด หรืออะไรต่างๆ ที่จะวางแผนด้วยกัน มีความขัดแย้งกันไม่ลงตัว ต่างฝ่ายต่างไม่ยอมกัน ก็เลยอาจจะทะเลาะกันบ้าง',
      image: '5.png',
      name: 'FIVE  OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ชายนายทหารผู้ได้รับชัยชนะ เดินทางกลับมายังเมือง โดยมีผู้คนมาร่วมสรรเสริญและแสดงความยินดีอยู่รอบข้าง ไพ่ใบนี้จึงหมายถึง การมีความคืบหน้า การได้รับชัยชนะ การจบปัญหาด้วยดี มีความมั่นใจ เชื่อมั่นในตัวเอง',
      love:
      'ความรักกับไพ่ใบนี้นั้น ก็เรียกได้ว่าเป็นความรักที่ดี ความรักมีความก้าวหน้า ความสัมพันธ์มีความเดินหน้าไปในทิศทางที่ดีขึ้น ถ้าหากความสัมพันธ์มีปัญหามาก่อนก็จะได้รับการแก้ไขไปอย่างดี',
      image: '6.png',
      name: 'SIX OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ความหมายไพ่ใบนี้จึงหมายถึงการ รักษาตำแหน่ง รักษาสิ่งที่เราคิดว่าถูก รักษาสิทธิ์ที่เป็นของเรา ต่อสู้กับปัญหาต่างๆที่เข้ามา จากสิ่งที่เราอาจจะยังไม่รู้ชัดว่าคืออะไร บางทีเราอาจจะคิดมากไปเองหรือกังวลเกินไป',
      love:
      'ความสัมพันธ์เหมือนมีอุปสรรคเข้ามา หรือแม้แต่ปัญหาภายใน เรื่องการที่อีกฝ่ายทำร้ายจิตใจคุณ ให้คุณต้องต่อสู้ฝ่าฟันเพื่อรักษาความสัมพันธ์ให้คงอยู่ต่อไป และอาจหมายถึงการต่อสู้เพื่อรักษาตัวตนของตัวเองในความสัมพันธ์ได้ด้วย',
      image: '7.png',
      name: 'SEVEN OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ไพ่ใบนี้แปลได้ว่า จะมีการเปลี่ยนแปลง มีเรื่องเข้ามากระทันหัน รวดเร็ว จนคุณตั้งตัวไม่ทัน ส่วนใหญ่จะแปลไปในทางที่ดี',
      love:
      'ความสัมพันธ์เป็นไปอย่างรวดเร็ว ความรักพัฒนาไปอย่างรวดเร็ว มีความคืบหน้า มีเรื่องเซอร์ไพรซ์ หากเป็นโสดก็มีความเป็นไปได้ถึงการที่มีคนเข้ามาทำให้ชอบ ทำให้รักอย่างรวดเร็ว ไม่ทันตั้งตัว',
      image: '8.png',
      name: 'EIGHT OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ทุกครั้งที่ผิดพลาดล้มเหลว ชายในไพ่ใบนี้จะได้รับบาดแผลแต่ก็ทำให้เค้าได้ประสบการณ์ความรู้ ไพ่ใบนี้จึงแปลได้ถึง การทำงานที่มีประสบการณ์ เพราะที่ผ่านมาอาจจะหนัก และล้มเหลวมาแล้ว จนทำให้รู้ถึงปัญหาและวิธีแก้ไขได้',
      love:
      'ความสัมพันธ์ที่เรียกได้ว่า เจ็บมาเยอะ จนทำให้มีประสบการณ์มามาก และทำให้มีรู้วิธีในการแก้ไขปัญหาความสัมพันธ์ต่างๆ ที่เข้ามา ได้อย่างดี ไพ่ใบนี้ในมุมมองหลักๆจึงเป็นความหมายที่ดี ที่สามารถดำเนินความสัมพันธ์ต่อไปได้ เพราะเรามีประสบการณ์ที่จะจัดการ',
      image: '9.png',
      name: 'NINE OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ไพ่ใบนี้แปลได้เลยว่าหมายถึง งานที่ครบ งานที่เต็ม ความปรารถนาความต้องการที่เต็มเปี่ยม แต่จาก ไพ่จะเห็นว่ามันยังไม่ถึงจุดสิ้นสุด ถึงแม้จะใกล้แล้วก็ตาม ดังนั้นสิ่งที่เราทำคือการ แบกรับ มันไว้ เพื่อให้ไปถึงจุดหมายที่เราตั้งเป้าไว้ อาจหมายถึงงานที่หนัก ภาระในจิตใจที่หนักอึ้ง แต่เราก็ยังคงเดินหน้าต่อไปยังเป้าหมายได้',
      love:
      'ถึงไพ่หมายเลข 10 จะหมายถึงการครบ จบสมบูรณ์ แต่ไพ่ใบนี้นั้นยังไม่ค่อยสมบูรณ์เท่าไหร่ ไพ่ใบนี้จะหมายถึงความสัมพันธ์ที่หนักอึ้ง อาจเป็นภาระด้านอื่นๆ เช่น เรื่องงาน เงิน ครอบครัว ที่อาจไม่เห็นด้วย',
      image: '10.png',
      name: 'TEN OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ไพ่ใบนี้จึงหมายถึงการเปลี่ยนแปลงหรือการเริ่มพัฒนา เริ่มต้น สิ่งใหม่ๆที่มีแรงผลักดัน มีแรงบันดาลใจ เช่น การผจญภัย การทำงานใหม่ทีท้าทายขึ้น และเราก็พร้อมที่จะลุยไป',
      love:
      'ความรักความสัมพันธ์ของไพ่ใบนี้ มักแปลถึงการเริ่มต้น การเปลี่ยนแปลง ความต้องการในการพัฒนาความสัมพันธ์ เป็นการเริ่มความรักที่ค่อนข้างจะรุนแรง หรือวัยรุ่นซะหน่อย คือมีความรักที่มาก เป็นความรักที่เหมือนการผจญภัย มีเรื่องน่าตื่นเต้นหวือหวาตลอดเวลา',
      image: '11.png',
      name: 'PAGE OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'ความหมายคือ การเดินหน้า ลุยทำในสิ่งที่ใจต้องการ จนบางทีอาจจะเป็นพวกรีบร้อน ทำอะไรโดยไม่คิดให้รอบคอบได้ อาจจะหมายถึงการที่ตะลุยทำงานอย่างมุ่งมั่น ตั้งใจ ด้วยพลังงานที่เปี่ยมล้น แต่ต้องระวังเรื่องความสะเพร่าด้วยเช่นกัน',
      love:
      'ไพ่ใบนี้หมายถึงความสัมพันธ์ที่เดินหน้าไปด้วยความรวดเร็ว ไปเร็วด้วยความต้องการ มีพลังพร้อมจะฝ่าฟันอุปสรรค มองในแง่ดีก็ถือว่าดี แต่เรื่องความรัก บางทีก็อาจจะขาดความรอบคอบไปซะหน่อย จนอาจจะทำให้ความสัมพันธ์ไม่ยืดยาวหรือยั่งยืนนัก',
      image: '12.png',
      name: 'KNIGHT OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'คนที่ได้ไพ่ใบนี้ (โดยเฉพาะผู้หญิง) เป็นคนที่มีความมั่นใจ สดใส มีความมุ่งมั่นสูง มีความฝัน ชอบปาร์ตี้สังสรรค์และทำงานเก่ง จู้จี้จุกจิก ถ้าหากได้ไพ่ใบนี้ขึ้นมา ก็อาจจะหมายถึงการที่จะได้พบ ผู้หญิงที่มีลักษณะแบบที่กล่าวมา เข้ามาในสถานการณ์ของคุณ',
      love:
      'ไพ่ราชินีไม้เป็นลักษณะของผู้หญิงที่มีสเน่ห์ มีความมุ่งมั่น ในการทำงาน ความฝัน และมีความเฟรนลี่ เพื่อนเยอะ ชอบสังคม ทำให้ดึงดูดคนเข้ามามากมาย แต่ถ้าโสดอยู่ ก็จะตอบได้ว่าผู้หญิงคนนี้ยังไม่คิดที่จะลงเอยกับใคร เพราะเธอค่อนข้างจะสามารถอยู่ตัวคนเดียวได้ พึ่งพาตัวเองได้',
      image: '13.png',
      name: 'QUEEN OF WANDS',
    ),
    cardTarotsWood(
      meaning:
      'คนที่ได้ไพ่ใบนี้จึงเป็นคนที่ค่อนข้างกระตือรือร้น มีแรงผลักดัน เพื่อให้ได้ในสิ่งที่ตัวเองต้องการ และเนื่องจากมีความเป็นผู้ใหญ่จากการเป็นราชา ไพ่ไม้เน้นไปที่เรื่องงาน ถ้าได้ใบนี้ก็เรียกได้ว่า อาจจะได้ทำงานเป็นหัวหน้า หรือเป็นคนที่เก่งในเรื่องงาน เป็นผู้นำในการทำงานได้อย่างดี',
      love:
      'ไพ่ใบนี้อาจจะเรียกได้ว่าเป็นความสัมพันธ์ที่มีพลังงาน มีแรงผลักดันในการพากันไปในเป้าหมายของความรักที่ต้องการได้  นอกจากนี้ยังหมายถึงความรักที่ใช้ความปรารถนาเป็นตัวนำพาไปได้ด้วย',
      image: '14.png',
      name: 'KING OF WANDS',
    ),

  ];
  final List<cardTarotsCup> cardsCup= [
    cardTarotsCup(
      meaning:
      'มีโอกาสที่จะได้ประสบพบเจอ คน หรือเหตุการณ์ที่ทำให้เราได้รับความรู้สึกใหม่ๆ เช่น ความรัก ความตื่นเต้น รวมไปถึงความเศร้าและเสียใจ แต่ไพ่ใบนี้ยังหมายถึงความคิดที่สร้างสรรค์ใหม่ๆในเชิง ศิลปะ ที่ใช้อารมณ์ เช่น บทเพลง บทกวี ได้อีกด้วย',
      love:
      'โอกาสที่จะได้เจอความรักใหม่ ถ้ามีคนรักอยู่แล้วก็หมายถึงความรักที่ชื่นมื่น อะไรที่ขาดหายไปก็อาจจะได้มีโอกาสอีกครั้ง เช่น จะมีเซอร์ไพรซ์ หรือมีสิ่งต่างๆที่ทำให้รู้สึกโรแมนติก และรักกันเหมือนครั้งแรกที่เจอ',
      image: '1.png',
      name: 'ACE OF CUPS',
    ),
    cardTarotsCup(
      meaning:
      'ไพ่ใบนี้เหมือนความเข้ากันได้ของคนสองคน การแลกเปลี่ยนอารมณ์ความรู้สึกกันได้อย่างลงตัว มีความเข้าใจ ความรู้สึกดี เรื่องการงาน การเงิน คุณโอเคกับเรื่องต่างๆ ไม่ว่าจะเรื่องการทำงาน หรือความสัมพันธ์กับเพื่อนร่วมงาน',
      love:
      'ถ้าเป็นคู่รักกันแล้ว รักกันดีมาก หากมีปัญหาก็สามารถข้ามผ่านไปได้ด้วยความเข้าใจ หากเป็นคนโสดหรือคนคุยที่กำลังคุยกัน หรือถามว่าเค้ารู้สึกยังไง ก็ต้องบอกได้ว่าต่างฝ่ายต่างรักกัน มีช่วงเวลาดีๆให้แก่กัน',
      image: '2.png',
      name: 'TWO OF CUPS',
    ),
    cardTarotsCup(
      meaning:
      'ความหมายของไพ่ใบนี้จึงหมายถึงเรื่อง เพื่อน เป็นส่วนใหญ่ การได้พบปะ สังสรรค์ กับเพื่อนฝูง ถ้ามองเป็นเรื่องอื่นๆ ก็จะมีคีย์เวิร์ด ที่เรื่อง เพื่อน ความเข้าใจกัน ความสุขหลังจากได้ร่วมงานกัน',
      love:
      'ความรักมีแนวโน้มที่จะพัฒนาไปในทางที่ดีแต่ไพ่ค่อนข้างออกไปในทางแนวเพื่อนมากกว่า ดังนั้นหากถามว่าเค้าคิดยังไงกับเราก็จะตอบไปในแนวเค้าก็เข้ากับเราได้ดี ชื่นชอบเรา แต่เป็นเพื่อนกันไปก่อนน่าจะดีกว่า',
      image: '3.png',
      name: 'THREE OF CUPS',
    ),
    cardTarotsCup(
      meaning:
      'มองในความหมายโดยรวมไพ่ใบนี้เหมือน มีสิ่งที่ลังเล สิ่งที่ทำให้รู้สึกยังไม่พร้อม ยังไม่โอเค ที่จะรับโอกาสใหม่ๆได้ อาจเป็นได้จากประสบการณ์ความรู้ที่ผ่านมา ที่ทำให้คนที่ได้ไพ่ใบนี้ไม่พร้อมรับโอกาสใหม่ๆ',
      love:
      'คนที่ได้รับไพ่ใบนี้จะเป็นคนที่กำลังเบื่อหนายในความรัก รู้สึกว่าความรักที่เข้ามาหรือความรักที่มีอยู่มันไม่ใช่ แม้จะมีตัวเลือกเข้ามา หรือมีคนเข้ามาจีบ ก็ยังไม่คิดที่จะรับรักใครง่ายๆ ถ้าเป็นคนโสดต้องบอกได้เลยว่าคนคนนี้ไม่สนใจความรักที่ได้รับ อาจเพราะอะไรก็แล้วแต่ ทำให้เค้าไม่อยากจะรับรักใคร',
      image: '4.png',
      name: 'FOUR OF CUPS',
    ),
    cardTarotsCup(
      meaning:
      'คนที่ได้ไพ่ใบนี้อาจจะพบการสูญเสียที่ทำให้รู้สึกเสียใจ ไม่ว่าจะเรื่องเงิน เรื่องงาน ความรัก หรืออะไรก็ตาม และไม่เปิดใจที่จะเดินหน้าต่อไป แม้โอกาสจะมีเข้ามาก็ตาม',
      love:
      'มักจะเป็นคนที่ไม่สามารถลืมอดีตได้ ไม่สามารถลืมความผิดพลาดและให้อภัยตัวเอง ในอดีตที่ทำพลาดไปได้ สิ่งนี้ทำให้คนๆนี้ไม่สามารถเริ่มต้นกับความรักใหม่ๆ หรือกล้าที่จะตัดสินใจทำอะไรใหม่ๆได้',
      image: '5.png',
      name: 'FIVE OF CUPS',
    ),
    cardTarotsCup(
      meaning:
      'ไพ่ใบนี้ตีความได้หลายหลาย ด้วยคีย์เวิร์ด ความรู้สึกเก่าๆ มันเป็นความรู้สึกดีๆ เช่น การได้นึกถึงวันเก่าๆ กลับบ้านเกิด การได้เจอพบปะเพื่อนเก่า และไพ่ใบนี้ยังหมายถึงการได้รับของขวัญจากคนที่รู้จักกันมาก่อนอีกด้วย',
      love:
      'ในมุมมองความรัก ก็หมายถึง ความรู้สึกเก่าๆกำลังจะกลับมาเช่นกัน โดยมากเป็นความรู้สึกที่ดี เช่น คุณจะได้เจอเพื่อนเก่า เจอคนรู้จักเก่าๆที่อาจทำให้คุณรู้สึกดี การได้เจอแฟนเก่าที่ไม่ว่าจะเลิกลากันไปดีร้ายยังไง',
      image: '6.png',
      name: 'SIX OF CUPS',
    ),
    cardTarotsCup(
      meaning:
      'หมายความว่า คุณคิด คุณฝัน ทางเลือกมากมายเอาไว้ แต่คุณก็ยังไม่เลือก ยังไม่ลงมือทำ มันถึงเวลาที่คุณจะต้องเลือก ต้องลงมือทำเปลี่ยนความคิดความคิดให้เป็นความจริง หากเป็นเรื่องการงาน เงิน ก็ดูเป็นการตัดสินใจเรื่องงาน เงินที่ตัดสินใจไม่ได้',
      love:
      'คนที่ได้ไพ่ใบนี้ดูมีทางเลือก ดูมีคนคุยหลายคน แล้วก็ยังเลือกไม่ได้ ตัดสินใจไม่ได้ที่จะเลือกใคร แต่ละคนก็มีข้อดี',
      image: '7.png',
      name: 'SEVEN OF CUPS',
    ),
    cardTarotsCup(
      meaning:
      'ไพ่ใบนี้มีความหมาย หมายถึงการเดินออกจากปัญหา จากสิ่งและอารมณ์ที่รบกวนจิตใจเราให้ขุ่นมัว ถ้วยก็คืออารมณ์ ถ้าหากสิ่งไหนที่ไม่โอเค ทำให้อารมณ์เราไม่โอเค ทำให้คุณรู้สึกเศร้าหมอง คุณก็พร้อมที่จะทิ้งมันไว้ แล้วเดินจากไปอย่างสงบ',
      love:
      'ทิ้งและเดินจากอะไรที่ไม่ดี ความสัมพันธ์ที่ไม่ดี ความรักที่ทำให้เราผิดหวัง รู้สึกแย่ ก็เดินจากไป ไพ่ใบนี้อาจไม่ได้หมายถึงการเลิกกันชัดเจน แต่ก็อาจหมายถึงการเลิกกันชั่วคราวหรือพัก',
      image: '8.png',
      name: 'EIGHT OF CUPS',
    ),
    cardTarotsCup(
      meaning:
      'หมายความว่า การพอใจ การได้รับการเติมเต็มในสิ่งที่ต้องการ ความหมายอีกอย่างจึงเหมือนกับว่า มีความสุข มีความพอใจ มั่นใจเกินเหตุ เกินความเป็นจริง เหมือนมีแค่ 9 ถ้วยก็อวดแล้ว ซึ่งมันก็รวมไปถึงการหลงตัวเองได้อีกด้วย',
      love:
      'ไพ่ใบนี้โดยรวมก็มี ความสุขดี พอใจ ในความสัมพันธ์ กรณีโสดเรียกได้ว่า พอใจที่จะโสด กรณีคบกันหรือกำลังคุยๆกันอยู่ก็จะหมายความว่า คนๆนี้ค่อนข้างจะโอเคและมีความสุขกับความสัมพันธ์นี้',
      image: '9.png',
      name: 'NINE OF CUPS',
    ),
    cardTarotsCup(
      meaning:
      'ไพ่ใบนี้ไม่ว่าเรื่องไหนก็ดูจะสุขสมหวังไปหมด ทุกอย่างดูราบรื่น มีความสุข อะไรๆก็เข้ากันได้ไปหมด ซึ่งไพ่ใบนี้เนื่องจากเป็นทางด้านอารมณ์ แม้ภายนอกทางกายภาพเช่น เรื่องเงิน หรือเรื่องงานอาจจะมีปัญหาบ้าง แต่ถ้าคุณมีความสุขอย่างมาก',
      love:
      'ไพ่ใบนี้ก็หมายถึงคุณมีความสุขกับคนรัก คนที่คุณรัก ทุกอย่างเข้ากันได้ดี สามารถวาดฝันถึงอนาคตไปถึงการสร้างครอบครัวได้ เรียกได้ว่า ทั้งคู่เติมซึ่งกันและกันจนเต็ม',
      image: '10.png',
      name: 'TEN OF CUPS',
    ),
    cardTarotsCup(
      meaning:
      'ไพ่ใบนี้ความหมายจึงเน้นไปที่เรื่อง อารมณ์ การเปลี่ยนแปลงไปสู่สิ่งใหม่ ถือเป็นไพ่ที่ดี ที่ทำให้เราอารมณ์ดีได้ครับ รวมถึงการได้พบเจอคนที่มีความคิดที่เด็กกว่า มีความคิดสร้างสรรค์ อาจหมายถึงการได้รับข่าวสารที่ดีที่ทำให้อารมณ์เราดีขึ้นได้ครับ',
      love:
      'เป็นไพ่ที่บ่งบอกถึงการเปลี่ยนแปลง เปลี่ยนสถานะความสัมพันธ์ ไปอีกระดับนึง',
      image: '11.png',
      name: 'PAGE OF CUPS',
    ),
    cardTarotsCup(
      meaning:
      'ไพ่ใบนี้จึงหมายถึง คนที่เลือกเดินหน้าไปตามเส้นทางที่หัวใจและตัวเองต้องการ โดยเป้าหมายการเดินทาง หรือการกระทำในครั้งนี้ จะนำพามาซึ่งความรู้สึกที่ดี การเงิน อาจเป็นไพ่ที่ไม่ได้บอกว่าการงาน การเงินจะดีนัก แต่เป็นไพ่ที่บอกว่า เรารู้สึกดีกับสิ่งที่จะเกิด',
      love:
      ' ค่อนข้างไปในทางที่ดี เป็นการพัฒนาความรัก ความสัมพันธ์ ไปข้างหน้าอย่างมีความสุข และโรแมนติก',
      image: '12.png',
      name: 'KNIGHT OF CUPS',
    ),
    cardTarotsCup(
      meaning:
      'หมายถึงผู้หญิงที่มีสเน่ห์ มีความเป็นแม่ที่เด่นในเรื่องความรู้สึก เข้าอกเข้าใจความรู้สึก และอารมณ์ทั้งของตัวเองและผู้อื่นได้ดี เป็นคนอ่อนโยน และอ่อนไหวได้ง่าย เป็นคนที่มีเซนส์ดี คาดเดาสิ่งๆต่างๆได้ถูกต้อง นอกจากนี้ยังแปลได้ถึงผู้หญิงที่อยู่ในช่วงนั้นของเดือนได้อีกด้วย',
      love:
      'ความสัมพันธ์มีความเข้าอกเข้าใจ ความรู้สึกของกันและกันอย่างดี รักกันมากและราบรื่น',
      image: '13.png',
      name: 'QUEEN OF CUPS',
    ),
    cardTarotsCup(
      meaning:
      'ความหมายของไพ่ใบนี้ ไม่ว่าจะเรื่องงานเรื่องเงินจะหมายถึงความสมดุลทางความรู้สึกและความคิด ทุกอย่างเลยดูราบรื่น ไม่มีปัญหาอะไรเข้ามาให้หม่นหมองใจและเครียด ไพ่ใบนี้ยังหมายถึง การได้พบชายที่มีความเป็นผู้ใหญ่ที่ใจดี เข้าอกเข้าใจผู้อื่นและมีเหตุผล',
      love:
      'ในด้านความรัก หากได้ไพ่ใบนี้ ความหมายจะออกแนว เรื่อยๆ โอเค ราบรื่น ปัญหาที่เข้ามาก็สามารถควบคุมและจัดการให้ผ่านไปได้ด้วยดี อารมณ์รุนแรง ดราม่าจะไม่เกิดในความสัมพันธ์',
      image: '14.png',
      name: 'KING OF CUPS',
    ),
  ];
  final List<cardTarotsSword> cardsSword = [
    cardTarotsSword(
      meaning:
      'หมายถึงความชัดเจน การตัดสินใจที่เด็ดขาด เหมือนถึงเวลาแล้วที่คุณจะเริ่มต้นทำอะไรที่ถูกต้องตามหลักเหตุผล ไพ่ใบนี้ความหมายดีไม่ดี ก็แล้วแต่มุมมอง บางทีก็อาจทำให้คุณรู้สึกแย่ทางอารมณ์ แต่การตัดสินใจเลือกทางที่ถูกตามหลักเหตุผลย่อมดีกว่าอยู่แล้ว',
      love:
      'ในด้านความรัก ใบนี้ค่อนข้างจะดีทีเดียว หมายถึงการเริ่มต้นใหม่ ความรู้สึกใหม่ๆ ที่ทำให้เรารู้สึกดี หากถามว่าอีกฝ่ายรู้สึกยังไงแล้วไพ่ใบนี้แทนเค้า หรือไพ่ใบนี้ขึ้นแทนตัวเราในสถานการณ์ก็หมายถึงอารมณ์ที่รุนแรง เต็มไปด้วยพลัง ความชอบ ความรัก ที่พร้อมจะพุ่งชน พุ่งจีบ ทีเดียว  ',
      image: '1.png',
      name: 'ACE OF SWORDS',
    ),
    cardTarotsSword(
      meaning:
      'หญิงสาวผู้ปิดตานั่งนิ่งถือดาบที่เปรียบเสมือนความคิด หลักการ การตัดสินใจ ไว้สองข้าง ด้านหลังเป็นทะเลที่นิ่งและโขดหินที่เปรียบเสมือนอารมณ์ที่มีอะไรมาขวางกั้นเป็นอุปสรรคที่ทำให้ไม่สามารถเลือกฟาดฟันดาบได้ ไพ่ใบนี้หมายถึง การตัดสินใจไม่ได้ ไม่สามารถตัดสินใจปัญหาด้วยหลักการและเหตุผลได้',
      love:
      'หมายถึงความสัมพันธ์ที่พยายามหลีกหนีปัญหา ไม่ตัดสินใจ ปล่อยปัญหาให้คาราคาซัง บางทีคุณก็รู้สึกไม่โอเคกับความสัมพันธ์ แต่คุณก็ยังไม่ตัดสินใจที่จะเดินออกมา จนอาจทำให้รู้สึกอึดอัด',
      image: '2.png',
      name: 'TWO OF SWORDS',
    ),
    cardTarotsSword(
      meaning:
      'เหมือนจะเกิดเรื่องบางเรื่องที่ทำให้คุณได้รับรู้ความจริง ได้รับรู้เหตุผล ต่างๆ แล้วมันก็ทำร้ายจิตใจคุณได้ ทำให้คุณรู้สึกเศร้า จิตตก แต่ไพ่ใบนี้อาจจะพูดได้ถึงในหลายๆด้านได้ เช่น เรื่องการงาน การเงิน นอกจากนี้ความเป็นเลขสาม อาจหมายถึง เรื่องการเลือก การรักสามเส้าได้อีกด้วย',
      love:
      'อาจเป็นรักที่ทำให้เรารู้สึกขัดแย้งอยู่ภายใน ความรักที่ เรารักมากจริงๆแต่ก็มีสิ่งที่ทำให้เราแย่ในด้านเหตุผล เช่น เค้าไม่รักเรา เค้าไม่สนใจ เค้าพูดทำร้ายจิตใจเรา หรืออื่นๆ เป็นสิ่งที่ทำให้คุณรู้สึกแย่',
      image: '3.png',
      name: 'THREE OF SWORDS',
    ),
    cardTarotsSword(
      meaning:
      'ไพ่ใบนี้มีความหมายถึงการหยุดพัก ทั้งทางใจและกาย เป็นไพ่ที่ปัญหาอาจจะยังไม่จบก็ได้ แต่คุณก็ขอพักไว้ก่อนนะตอนนี้',
      love:
      'ในด้านความรัก ความหมายชัดๆคือ การหยุดพัก ในปัญหาที่เกิดขึ้น ป็นไพ่ที่ดีสำหรับคนที่ได้ไพ่ใบนี้ เพราะจะมีความสบายใจ ฟื้นฟูความรู้สึกของตัวเองให้ดีขึ้นได้',
      image: '4.png',
      name: 'FOUR OF SWORDS',
    ),
    cardTarotsSword(
      meaning:
      'หากมองในมุมผู้ชนะ ก็เหมือนผู้ชนะการประลอง เป็นเจ้ายุทธจักรที่ชนะก็จริง แต่สิ่งที่ต้องสูญเสียไประหว่างการต่อสู้ก็ไม่ได้มีอะไรกลับมา หากมองในมุมผู้แพ้ ก็คือผู้ที่ต้องพ่ายแพ้ไป สูญเสียความมั่นใจ และต้องเดินจากไปจากสถานการณ์นี้ พ่ใบนี้จึงมองไปในแง่ลบ มีการขัดแย้งกัน ทะเลาะกัน และมีการสูญเสีย',
      love:
      'ความรักในไพ่ใบนี้ก็เป็นการทะเลาะกัน การขัดแย้งกัน ความไม่เข้าใจกัน ต่างฝ่ายต่างมีอีโก้ มีเหตุผลของแต่ละฝ่าย ซึ่งเข้ากันไม่ได้',
      image: '5.png',
      name: 'FIVE OF SWORDS',
    ),
    cardTarotsSword(
      meaning:
      'เป็นไพ่ที่มีความหมายถึงการเดินต่อไปข้างหน้า มุ่งหน้าต่อไป ทิ้งความรู้สึกไม่ดีไว้เบื้องหลัง, เวลาแห่งการเปลี่ยนแปลงได้มาถึงแล้ว, ความสัมพันธ์ที่ยังไม่จบสิ้น แต่อาจมองได้หลายแบบ ว่าเราจะเลือกเดินหน้าเปลี่ยนแปลงไปทางไหน แต่หลักสำคัญของมันก็คือ เราทิ้ง เราปล่อยสิ่งที่ไม่ดีต่อเรา สิ่งที่ไม่ดีกับใจเราไว้ด้านหลัง',
      love:
      'ในเรื่องความรักความสัมพันธ์ ไพ่ใบนี้ส่วนใหญ่มักแปลว่า ความสัมพันธ์ที่ยังไม่จบ โดยเฉพาะถ้าถามถึงความสัมพันธ์ที่ไม่โอเค ไม่ดี ก็ต้องบอกว่า มันยังไม่จบ เรายังมีรักษาความสัมพันธ์นั้นออกไป โดยทิ้งสิ่งที่ไม่โอเคไว้เบื้องหลัง',
      image: '6.png',
      name: 'SIX OF SWORDS',
    ),
    cardTarotsSword(
      meaning:
      'ไพ่ใบนี้ความหมายอาจแปลได้ตรงๆว่า โดนขโมยเงิน สิ่งของก็ได้ หรือโดนขโมยความคิดก็ได้ เช่น โดนขโมยผลงาน ขโมยแนวคิด อาจหมายถึงการแอบทำลับหลังเป็นได้ทั้งร้าย เช่น การโกง การแอบนินทา ใส่ร้ายป้ายสี ขโมย และทั้งดี เช่น การวางแผนที่ไม่ให้ใครรู้เพื่อผลลัพธ์ที่ดีกว่า การวางแผนทำเซอไพรซ์ เป็นต้น',
      love:
      'ในด้านความรัก ไพ่ใบนี้แปลได้ทั่วไปว่า การโกง แอบไปมีคนอื่น การไม่รักเดียวใจเดียว ไม่ซื่อสัตย์ คนที่ได้ไพ่ใบนี้ขึ้นแทนตำแหน่งตนเอง กำลังไม่ซื่อสัตย์กับคุณ เค้ากำลังแอบทำลับหลังคุณ',
      image: '7.png',
      name: 'SEVEN OF SWORDS',
    ),
    cardTarotsSword(
      meaning:
      'ความหมายของไพ่ใบนี้คือ การที่เราไม่สามารถเลือกทำอะไรได้เลย ไม่สามารถตัดสินใจ ไม่สามารถดำเนินการได้ เหมือนคุณโดนกรอบความคิดของตัวเองล้อมเอาไว้ แม้อยากจะไปก็ไปไม่ได้ และไพ่ใบนี้ก็ยังหมายถึงการถูกกักขัง ไม่ว่าจะกักขังจองจำจริงๆ หรือโดนกักขังทางความคิด',
      love:
      'ไพ่ใบนี้ความหมายค่อนข้างจะออกติดลบ มันเหมือนเป็นความสัมพันธ์ที่ทำให้คุณ "กลับตัวก็ไม่ได้ ให้เดินต่อไปก็ไปไม่ถึง" ไม่สามารถเลือกได้ เพราะโดนความคิดครอบงำไว้จนตัดสินใจไม่ได้ว่าจะทำยังไงดี',
      image: '8.png',
      name: 'EIGHT OF SWORDS',
    ),
    cardTarotsSword(
      meaning:
      'ไพ่ใบนี้จะหมายถึง ความกดดัน ความเครียด ที่ทำให้คุณนอนไม่หลับ ไพ่ใบนี้จึงเหมือนออกมาเตือนว่า คุณคิดมาก เครียดหรือกดดันมากไปรึเปล่า ลองดึงดาบทั้ง 9 ออกแล้วคิดตัดสินใจสิ่งต่างๆให้ดีด้วยเหตุผล และมองหาทางแก้ปัญหาจะดีกว่า',
      love:
      'ความคิดมาก คิดเยอะ กังวล ไปกับความรักค่อนข้างมาก เป็นความสัมพันธ์ที่ทำให้คุณรู้สึกว่า คุณกังวล ระแวง คิดมาก ตลอดเวลาจนอาจถึงขั้นทำให้นอนไม่หลับ แต่ไพ่ใบนี้เป็นไพ่ ความคิด บางทีเรื่องยังไม่เกิด ยังไม่มีอะไร คุณก็ระแวง และคิดมากไปก่อน',
      image: '9.png',
      name: 'NINE OF SWORDS',
    ),
    cardTarotsSword(
      meaning:
      'ไพ่ใบนี้นอกจากจะคิดมากจนคิดต่อไปไม่ไหว หรือหยุดคิดเรื่องนี้แล้ว ยังมีมุมดีของมันคือ การที่จะมีอนาคตข้างหน้าที่สดใสกำลังรออยู่ เหมือนแสงที่ส่องมาจากปลายฟ้า เหมือนหากเราหยุดคิด หยุดเครียด เราจะได้พบหนทางที่สดใสขึ้น พบวิธีแก้ปัญหาที่เข้ามารุมเร้าได้',
      love:
      'ไพ่ใบนี้ในความหมายเรื่องความรักค่อนข้างจะเป็น ความหมายในเชิงลบ คือความสัมพันธ์ที่มาถึงจุดจบ ความสัมพันธ์ที่ไปต่อไม่ได้ อาจหมายถึงการเลิกลาได้',
      image: '10.png',
      name: 'TEN OF SWORDS',
    ),
    cardTarotsSword(
      meaning:
      'ความคิดอยู่ในช่วงที่มีการเปลี่ยนแปลง ที่อาจรวมไปถึง การคิดให้รอบคอบ การสงสัย การเริ่มต้นการติดต่อสื่อสาร รวมถึงการเริ่มต้นคิดวิเคราะห์สิ่งใหม่ๆ',
      love:
      'เป็นไพ่ที่แสดงถึงความสงสัยและพูดคุยกันเพื่อเคลียร์กันซะมากกว่า ไพ่ใบนี้อาจดูไม่ค่อยดีในสถานการณ์ที่ไม่ได้หวานแหวว แต่มองในอีกมุมก็ถือว่าเป็นไพ่ที่แสดงถึงการเคลียร์ข้อสงสัย ที่ค้างคาใจกัน ให้เข้าใจกันมากขึ้น',
      image: '11.png',
      name: 'PAGE OF SWORDS',
    ),
    cardTarotsSword(
      meaning:
      'เราพร้อมตะลุย ฝ่าฟันอุปสรรค เพื่อให้ไปถึงเป้าหมายที่เราคิด และตั้งใจไว้ หรืออาจหมายถึงการฝ่าฟันปัญหา เรื่องที่ไม่เข้าใจกัน จะมีการพูดคุย ถกเถียง ทะเลาะกันได้ เพื่อให้ทุกอย่างกระจ่างขึ้น และอาจหมายถึงการได้พบเจอคนที่มีลักษณะนิสัยเป็นอัศวินดาบดังที่กล่าวมา',
      love:
      'หมายถึงความสัมพันธ์ที่พร้อมจะลุยฝ่าฟัน แม้มีอุปสรรค ก็พร้อมจะลุยกันไปด้วยดี หรือ หากเป็นความสัมพันธ์ที่มีปัญหามาก่อน มีเรื่องไม่เข้าใจกัน การที่มีการถกเถียงทะเลาะกัน เพื่อให้ได้ความชัดเจนกันทั้งสองฝ่าย',
      image: '12.png',
      name: 'KNIGHT OF SWORDS',
    ),
    cardTarotsSword(
      meaning:
      'ส่วนไพ่ราชินีที่มีสัญลักษณ์ของ ธาตุน้ำ คือเป็นผู้ที่ขับเคลื่อนด้วยอารมณ์ภายใน มีความละเอียดอ่อน นึกถึงจิตใจผู้อื่น ถือดาบซึ่งเป็นสัญลักษณ์ของ ธาตุลม แสดงถึงความคิด ตรรกะ เหตุผล และความรวดเร็ว เป็นผู้หญิงที่เป็นคนมีเหตุผลสูง ผู้หญิงที่มีความเป็นผู้นำ มีความโดดเดี่ยว',
      love:
      'ไพ่ราชินี มักเป็นตัวแทนของ ผู้หญิง ถ้าถามถึงว่าผู้หญิงคนนี้คิดอย่างไรกับคุณ หรือคิดยังไงกับความสัมพันธ์ ก็ตอบได้เลยว่า เธอเป็นคนที่เด็ดเดี่ยว โดดเดี่ยว ถ้าใน กรณีที่โสด ก็ตอบได้เลยว่า เธอ ไม่พร้อมจะมีใคร',
      image: '13.png',
      name: 'QUEEN OF SWORDS',
    ),
    cardTarotsSword(
      meaning:
      'ไพ่ราชาเป็นไพ่ธาตุลม ซึ่งหมายถึงความคิด มีตรรกะ มีความเป็นผู้ใหญ่ มีเหตุผลชัดเจน เมื่อเป็นไพ่ดาบด้วยแล้ว ยิ่งเป็นคนที่มีความคิดที่ชัดเจนมากยิ่งขึ้น จนอาจเรียกได้ว่า เป็นคนคิดมากคิดเยอะ มีเหตุผลสุดๆ เป็นราชาแห่งการคิด',
      love:
      'ความสัมพันธ์ความรักของไพ่ใบนี้ ต้องบอกว่าเป็นความสัมพันธ์ที่ค่อนข้างจะคบกันด้วยเหตุและผล หากมีปัญหาอะไรกันก็คุยกันรู้เรื่อง พูดคุยกันง่ายไม่ใช้อารมณ์มาตัดสิน',
      image: '14.png',
      name: 'KING OF SWORDS',
    ),
  ];
  final List<cardTarots22> cards = [
    cardTarots22(
        work:
        'หมายถึงการเริ่มต้นกิจการใหม่ๆหรือหมายถึงการเบื่อๆเรื่องงานอยากไปพักร้อน',
        money:
        'ภาวะทางการเงินจะไม่แน่นอนคาดหวังความสม่ำเสมอไม่ได้',
        love:
        'หมายถึงคนเจ้าชู้และอิสระสูงไม่ชอบให้แฟนมาคุม',
        health: 'ระวังเกี่ยวกับระบบความดันโลหิต',
        image: '1.png',
        name: 'The Fool'),
    cardTarots22(
        work:
        'เหมาะกับงานที่เกี่ยวข้องกับคนจำนวนมากๆเช่นพิธีกร ดีเจ วีเจ งานการสอนก็ดี เพราะสามารถสื่อให้คนเข้าใจได้ง่าย หรือทำงานไม่ตรงกับสายที่เรียนมา',
        money:
        'หมายถึง จะมีสภาพการเงินที่ดีขึ้น ส่วนใหญ่ตามที่ดูมา จะไม่ดีมาก แต่ก็ไม่แย่ หากเงินหมดก็สามารถหามาได้ทัน',
        love:
        'คนรักใหม่และคนรักเก่าจะมาในช่วงที่คุณไม่อยากมีความรักเท่าใดนัก หากแอบชอบใครอยู่อาจไม่สมหวัง',
        health: 'ระวังระบบทางเดินหายใจและระบบปลายประสาทอักเสบ',
        image: '2.png',
        name: 'The Magician'),
    cardTarots22(
        work:
        'ธุรกิจจะดำเนินไปอย่างเชื่องช้าในระยะแรก อาชีพที่เหมาะสมคือศิลปินทุกรูปแบบหรืองานพวกการสืบสวน ก็ได้',
        money:
        'คุณจะต้องใช้ความอดทน การเงินจะมาแบบช้าๆ',
        love:
        'ในท่านชายอาจพบหญิงคนหนึ่งที่มีเสน่ห์น่าลุ่มหลง ในท่านหญิงอาจจะเป็นรักข้างเดียวหรือรักซ้อนก็ได้',
        health: 'เนื่องจากไพ่ใบนี้เกี่ยวกับธาตุน้ำ จึงควรระมัดระวังระบบการย่อยอาหาร ไต หรือระบบปัสสาวะ',
        image: '3.png',
        name: 'The High Priestress'),
    cardTarots22(
        work:
        'ถ้าจะค้าขายก็เหมาะของสวยๆงามๆหรือไม่ก็พวกอิเล็กโทรนิคไปเลย ส่วนงานยังไม่เสร็จตามกำหนดต้องแก้ไขปรับปรุง',
        money:
        'ได้แน่นอนแต่ช้า การทวงหนี้ไม่โกงแต่คุณได้ช้า หากจะขอความช่วยเหลือก็เป็นเพศหญิงที่ขาวๆรูปร่างอวบๆ ดีกว่า',
        love:
        'เป็นไพ่ของความสมหวัง อาจลงท้ายด้วยการแต่งงาน หรือหมายถึง การมีเพศสัมพันธ์ที่เกิดจากความรัก การตั้งครรภ์ หรือมีการหึงหวงถ้ามีไพ่ 7 ดาบมาประกบติดล่ะก็หึงจนน่ารำคาญเลยเชียว',
        health: 'ระวังเกี่ยวกับระบบการสืบพันธุ์เช่นมดลูก',
        image: '4.png',
        name: 'The Empress'),
    cardTarots22(
        work:
        'ลักษณะงานที่ถูกโฉลกจะเกี่ยวกับวิทยาศาสตร์ เทคโนโลยีสมัยใหม่ การเมือง ราชการ ถ้ามีการเจรจาแบ่งผลประโยชน์ จะเป็นไปอย่างราบรื่น',
        money:
        'ควรระมัดระวังการใช้จ่ายอย่างฟุ่มเฟือยหน้าใหญ่ใจกว้าง เงินจึงมักขาดมือแต่ว่าสามารถหามาได้ทันกัน',
        love:
        'สำหรับท่านหญิงที่หยิบได้ไพ่ใบนี้ แปลได้ว่าจะพบรักกับชายอายุมากกว่าหรือเป็นคนต่างชาติ หรือหมายถึงเราออกไปเข้าสังคมมากขึ้น่',
        health: 'ระวังที่ศีรษะ มักจะมีอาการปวดหัวได้ง่าย',
        image: '5.png',
        name: 'The Emperor'),
    cardTarots22(
        work:
        'หมายถึงคุณอาจจะมีปัญหาจุกจิกๆ ในงาน หรือมีคนจุกจิกใส่คุณ อาชีพที่เหมาะสม มักจะรับราชการ แพทย์ ครู',
        money:
        'หมายถึง คุณจะวางแผนการเงินใหม่แต่อย่าเคร่งครัดมากนะ ถ้าหากตบะแตกขึ้นมาเงินเก็บจะพลอดหดหายไปด้วย',
        love:
        'หากผู้หญิงเปิดได้ไพ่ใบนี้หมายถึง ได้แต่งงานช้าหรือคู่อายุแก่กว่ามาก และหากได้แต่งก็จะทำพิธีอย่างถูกต้องตามประเพณี',
        health: 'ให้ระมัดระวังระบบการย่อย ท้องอืด ท้องเฟ้อ',
        image: '6.png',
        name: 'The Hierophant'),
    cardTarots22(
        work:
        'อาจจะได้เปลี่ยนงานใหม่ ได้หุ้นส่วนที่ดีหรือคุณจะมีทางสายใหม่ที่ดีกว่าเดิมให้ทำ',
        money:
        'การเงินสามารถหามาได้เรื่อยๆ แบบสบายๆ',
        love:
        'ไม่ต้องสงสัยเลยว่าคุณกำลังอยู่ในช่วงกำลังมีความรัก อย่าเฉื่อยชาหรือกระตือรือล้นจนเกินไป หากเป็นคนโสด ก็จะพบรักในเวลาไม่นานนัก',
        health: 'ระวังพวกลมในกระเพาะอาหาร การจุกเสียด',
        image: '7.png',
        name: 'The Lover'),
    cardTarots22(
        work:
        'หมายถึง เหมาะกับงานที่เกี่ยวกับการขนส่งทุกชนิด การเป็น สจ๊วต หรือ แอร์ มักจะได้ไพ่ใบนี้ หรือการจะหมายถึงการทำงานกับคนต่างชาติ ต้องใช้ภาษาต่างต่างประเทศก็ได้',
        money:
        'หมายถึง ต้องเผชิญปัญหาการเงิน แต่ก็สามารถผ่านพ้นมาได้ ต้องมีการโต้เถียง หรือขัดแย้งกัน จึงจะได้เงินนั้นมา',
        love:
        'คนโสด คุณอาจพบรักกับคนแปลกหน้า คนที่มีคนรักแล้วอาจจะมีปัญหาจำเป็นต้องแยกกันสักพักและกลับมาคืนดีกัน',
        health: 'มักเกี่ยวกับระบบการย่อยการขับถ่ายไม่ดี',
        image: '8.png',
        name: 'The Chariot'),
    cardTarots22(
        work:
        'คุณอาจจะได้รับรางวัลแห่งความสำเร็จในความเพียร หรืองานเกี่ยวกับการดูแลความงามก็ได้',
        money:
        'เงินที่คาดหวังไว้จะได้มา ความยุ่งยากทางการเงินจะได้รับการแก้ไข',
        love:
        'หมายถึงหากคุณเพิ่งพบใครบางคน เวลาจะเป็นตัวช่วยให้ความรักของคุณมั่นคงขึ้น ในรายที่ไม่มีแฟน คุณยังไม่พร้อมที่จะรักใครเนื่องจากยังอาวรณ์กับความหลัง',
        health: 'แข็งแรงมาก หรือฟื้นตัวจากการไม่สบาย',
        image: '9.png',
        name: 'The Strength'),
    cardTarots22(
        work:
        'งานที่ทำเหมาะกับโครงการระยะยาว หากถามถึงงานที่ทำอยู่ ก็มักจะได้ดีในภายหลัง ถ้ากล่าวถึงอาชีพ เหมาะกับ แพทย์ อาจารย์ นักเขียน นักวิชาการ',
        money:
        'หมายถึง เงินที่เข้ามาเป็นระลอก มีมากพอที่จะจ่ายลงไป',
        love:
        'เป็นช่วงเวลาที่อยู่ตามลำพัง รู้สึกเหงา ไม่มีใคร หรือหมายถึงการได้แต่งงานเมื่ออายุมากแล้วและรวมทั้งถ่านไฟเกิดคุขึ้นมาอีก คนรักเก่าอาจกลับเข้ามาสู่ชีวิตคุณอีกครั้งหนึ่ง',
        health: 'อาการเหมือนโรคซึมเศร้า',
        image: '10.png',
        name: 'The Hermit'),
    cardTarots22(
        work:
        'หมายถึง เจ้าชะตายังไม่พอใจกับเรื่องของงานมากนัก อยากจะทำให้ดีกว่าเดิม หมายถึงทำงานเกี่ยวกับด้านบ้านและที่ดินก็ได้',
        money:
        'การเงินจะมีพอเข้ามาให้ใช้จ่ายทำให้ไม่กังวลใจมากนัก',
        love:
        'หากมีความสัมพันธ์อยู่แล้วหมายถึงการคบกันสบายๆไม่หึงหวงซึ่งกันและกัน และอาจจะมีคนรักเก่ากลับเข้ามาในชีวิตอีกครั้งหนึ่ง ในคนโสด มีแนวโน้มว่า จะได้พบใครสักคนท่ามกลางคนหมู่มาก',
        health: 'ระวังโรคในช่องท้อง พวกกระเพาะอาหาร ตับ ไต',
        image: '11.png',
        name: 'The Wheel of Fortune'),
    cardTarots22(
        work:
        'ในการทำงานจะได้รับความยุติธรรมจากคนรอบข้าง เหมาะที่จะทำงานเกี่ยวกับราชการรัฐวิสาหกิจ หากมีไพ่ 6 ไม้ขึ้นประกอบจะชัดเจนยิ่งขึ้น งานด้านอื่น เช่น งานบัญชี สถาปนิก',
        money:
        'สถานะการเงินเป็นแบบมาเร็วไปเร็ว',
        love:
        'จากประสบการณ์แล้วหากมีเพศตรงข้ามเข้ามาติดพันและหลงคุณมากๆ ต้องระวังให้มากเค้าจะแค่หลงอยู่พักหนึ่งแล้วก็จะจากไป',
        health: 'ส่วนใหญ่จะไม่ค่อยเจ็บป่วย',
        image: '12.png',
        name: 'Justice'),
    cardTarots22(
        work:
        'ต้องมีความอดทนกับสภาวะการงานที่ทำอยู่ ธุรกิจที่ทำอยู่เริ่มส่อเค้าปัญหา ไพ่ใบนี้โฉลกกันกับงาน แพทย์ พยาบาล หรือคนทำงานในวงการมายา นักข่าว',
        money:
        'จะมีปัญหาด้านการเงิน มีคนจะมาเอาเปรียบด้านการเงิน คนที่มีหนี้สินมักจะได้ไพ่ใบนี้ระวังการค้ำประกันหน่อยก็จะดี',
        love:
        'คนโสด หมายถึง มีความโหยหาในเรื่องความรัก มีความอ่อนไหว หากเพิ่งเริ่มคบกัน อย่างเพิ่งเทใจ',
        health: 'หมายถึงโรคเบาหวาน ในท่านหญิงระวังเกี่ยวกับ มดลูกด้วย',
        image: '13.png',
        name: 'The Hanged Man'),
    cardTarots22(
        work:
        'หมายถึง อาจมีความล้มเหลว ผิดหวัง หุ้นส่วนแตกคอกัน ไพ่ใบนี้เหมาะกับอาชีพ แพทย์ พยาบาล ประกันภัย ประกันชีวิต ตำรวจ หรือทหาร หรือบริษัทประเภท ก๊าซ น้ำมัน สารเคมี',
        money:
        'หมายถึง รายได้ค่อนข้างแย่มาก รายได้ตกลงอย่างเห็นได้ชัด ต้องระวัง เงินหาย ถูกยกเค้า โดนล้วงกระเป๋า',
        love:
        'หากมีคนรักจะมีปัญหา จนอาจเลิกกันได้ ในคนโสด หมายถึง จะพบกับคนที่น่าหลงใหลอย่างมาก',
        health: 'อาจเจ็บป่วยกระทันหัน ป่วยหนักต้องเข้าโรงพยาบาล',
        image: '14.png',
        name: 'Death'),
    cardTarots22(
        work:
        'หมายถึง มีโอกาสย้ายงาน หรือออกจากงานค่อนข้างสูง หากเปิดได้ในขณะทำนายภาวะปัจจุบัน มีการเดินทางไปพบปะผู้คน เพื่อเจรจาตกลงทางธุรกิจ',
        money:
        'หมายถึง มีการหมุนเงินเยอะมากในช่วงนี้',
        love:
        'หากกำลังมีปัญหากับคนรักอาจต้องการเลิกรา ที่เลิกก็จะกลับมารักกัน คนโสด เพื่อนแนะนำใครบางคนมาให้',
        health: 'การทำงานโดยไม่หยุดพัก ทำให้ร่างกายอ่อนแอ',
        image: '15.png',
        name: 'Temperance'),
    cardTarots22(
        work:
        'ไพ่ใบนี้จะให้ผลดีกับผู้ที่ทำงานเกี่ยวกับอบายมุขทั้งปวง เช่น เปิดบ่อน ขายเหล้า เบียร์ เปิดผับ บาร์ อาบอบนวด เป็นต้น หากเป็นคนทำงานปกติทั่วไป มักจะมีงาน Part time เข้ามา',
        money:
        'หมายถึงการทำงานหนักมาก หากทำธุรกิจของตนเอง จะได้กำไรน้อยมาก ไม่สมกับที่ลงแรงทำลงไป',
        love:
        'หมายถึง จะมีแรงดึงดูดระหว่างกันและกันอย่างมิอาจต้านทานได้ ภายหลังจากความปรารถนาอันแรงกล้าผ่านไปแล้ว อาจพบว่าไม่มีอะไรเหมือนกันเลยทำให้ต้องเลิกกันไป',
        health: 'มีโอกาสเป็นเกี่ยวกับโรคทางเพศสัมพันธ์',
        image: '16.png',
        name: 'The Devil'),
    cardTarots22(
        work:
        'หมายถึง สิ่งที่คิดว่ากำลังไปได้ด้วยดีกลับพังทลายลงอย่างไม่คาดคิด ปัญหามักจะเกิดกะทันหันโดยไม่ทันตั้งตัว',
        money:
        'จะเกิดการสูญเสียเงิน หรือเสียเงินก้อนโตนับตั้งแต่ที่เคยเสียมา',
        love:
        'อาจจะอกหัก หรือมีการหย่าร้างเกิดขึ้น หากเป็นคนโสดและมีไพ่ความรักที่ดีใบอื่นประกบอยู่หมายถึงจะพบรักกะทันหัน',
        health: 'ระวังการเจ็บป่วยแบบกระทันหันหรืออุบัติเหตุ',
        image: '17.png',
        name: 'The Tower'),
    cardTarots22(
        work:
        'หมายถึง ต้องการปรับปรุงให้ดีขึ้นต่อไป งานที่เกี่ยวข้องกับความสวยงาม ศิลปะจะดีมาก รวมถึงงานก่อสร้างบ้านเรือน วัสดุก่อสร้าง หรือของตกแต่งบ้านก็ได้',
        money:
        'คาดการณ์สิ่งใดเกี่ยวกับการเงินไว้มักจะได้ตามที่คาด',
        love:
        'หมายถึง ส่วนใหญ่ผู้ที่ได้มักเป็นโสด โดยใช้เวลาส่วนใหญ่กับเพื่อนฝูง',
        health: 'เมื่อไพ่ใบนี้ปรากฏมักเป็นข่าวดี มักเป็นการฟื้นตัวจากความเจ็บป่วย',
        image: '18.png',
        name: 'The Star'),
    cardTarots22(
        work:
        'หมายถึง อย่าวู่วาม ต้องควบคุมอารมณ์อย่างมาก อาจมีคนกลั่นแกล้งในงานระมัดระวังปัญหาเกี่ยวกับเอกสารต่างๆ ให้ดี',
        money:
        'หมายถึงต้องระมัดระวังอาจถูกโกงเงินหุ้นส่วนเอาเปรียบ ระมัดระวังด้านเอกสารให้ดี',
        love:
        'หากมีคนรักแล้ว อาจถูกคนรักหลอกลวงอยู่ หากเป็นคนโสด หมายถึง คนกำลังโหยหาความรักอย่างมาก',
        health: 'ระวังระบบเลือด น้ำเหลือง และมดลูกไม่ดี',
        image: '19.png',
        name: 'The Moon'),
    cardTarots22(
        work:
        'จะได้งานใหม่หากตกงานอยู่ ธุรกิจส่วนตัวจะคล่องตัวขึ้นการติดต่อการงานกับผู้ใหญ่ จะเป็นไปอย่างราบรื่นแต่ต้อง',
        money:
        'หากรอข่าวใดอยู่ จะได้รับข่าวดี มักจะมีชื่อเสียงในการทำงานก่อน เงินจึงจะได้รับตามมาภายหลัง',
        love:
        'หมายถึงจะได้คู่ที่ดี ช่วยส่งเสริมกันและกันให้เจริญรุ่งเรือง หากยังไม่มีคนรักก็จะมีเข้ามา ทำนองว่าช้าแต่ชัวร์',
        health: 'โดยส่วนมากแข็งแรง แต่ก็ต้องระวังเรื่องความดันโลหิตไว้บ้างก็จะดี',
        image: '20.png',
        name: 'The Sun'),
    cardTarots22(
        work:
        'หากเพิ่งลาออกจากงานก็จะได้งานใหม่ในเวลาไม่นานนัก จากประสบการณ์มักจะได้งานจากเพื่อนฝูงบอกต่อมาให้มา',
        money:
        'จะเห็นได้ชัดว่า เริ่มมีการเปลี่ยนแปลงในทางที่ดีขึ้น เรื่องการเงิน หากลงทุนอะไรลงไปก็จะได้รับผลตอบแทนค่อนข้างดี',
        love:
        'จะหมายถึง เป็นเรื่องที่ต้องตัดสินใจ เนื่องจากคนรักเก่าได้หวนกลับมา แต่ถ้าได้ไพ่ใบนี้ประกบ8ไม้จะอาการเหมือนกับรักแรกพบเลยล่ะ',
        health: 'มักฟื้นตัว แต่ถ้าป่วยก็มักเป็นโรคเดิมที่เคยป่วย',
        image: '21.png',
        name: 'Judgement'),
    cardTarots22(
        work:
        'หมายถึงงานที่ทำมานานจะประสบความสำเร็จตามที่หวังโดยเฉพาะในสายงานศิลปะงานพวกนายหน้าขายที่ดินก็ดีเช่นกัน',
        money:
        'หมายถึง เงินจะมาจากหลายๆ ทาง ส่วนใหญ่ จะมาจากสิ่งที่คุณทำมาแล้วเป็นระยะเวลานาน',
        love:
        'หากเปิดไพ่ Empress และ The Sun มาประกบคู่กันหมายถึงการมีบุตร',
        health: 'มสุขภาพแข็งแรง',
        image: '22.png',
        name: 'The world'),
  ];
  String typeCard = "";
  
  @override
  Widget build(BuildContext context) {
    
      List<String> folder = ['ไพ่ชุดใหญ่','ไพ่ดาบ','ไพ่ถ้วย','ไพ่เหรียญ','ไพ่ไม้'];
      List<String> img = ['${number[0]}.png','${number[1]}.png','${number[2]}.png','${number[3]}.png','${number[4]}.png'];

    return Scaffold(
      appBar: AppBar(title:Center(child: Text('SHOW YOUR FUTURE')),
        backgroundColor: Colors.orangeAccent,),
      body: Stack(
        children : [
          Container(
            decoration: BoxDecoration(
              image: DecorationImage(
                image: AssetImage("assets/images/bg/prm2.jpg"),
                fit: BoxFit.cover,
              ),
            ),
            child: null /* add child content here */,
          ),
          Padding(
            padding: const EdgeInsets.all(20.0),
            child: Container(

              height: 700,
              child: ListView.builder(
                scrollDirection: Axis.vertical,
                itemCount: 5,
                itemBuilder: (BuildContext context, int position) {
                  return InkWell(
                  onTap: () => setState(() => selectedIndex=position),
                    child: Column(
                      children: [
                        Padding(
                          padding: const EdgeInsets.only(bottom: 10.0,top: 20.0),
                          child: Text(position==4 ? 'ด้านการงาน' : position==3 ? 'ด้านการเงิน' : position==2 ? 'ด้านความรู้สึก' : position==1 ? 'ด้านความคิด' : 'ชีวิตช่วงนี้',
                            style: TextStyle(fontWeight: FontWeight.bold,color: Colors.white),
                          ),
                        ),
                        Card(
                          shape: (selectedIndex==position) ?
                          RoundedRectangleBorder(
                              side: BorderSide(color: Colors.amber, width: 5))
                              : null,
                          elevation: 5,
                          child: Image.asset(
                            'assets/images/cards/${folder[position]}/${img[position]}',
                            width: 200,
                            height: 350,
                            fit: BoxFit.contain,
                          ),
                        ),
                      ],
                    ),
                  );
                },
              ),
            ),
          ),
        /*  Padding(
            padding: const EdgeInsets.only(left: 248,top: 290),
            child: RaisedButton(
              onPressed: () {
                print('selected $selectedIndex');
                print('selected ${folder[selectedIndex]}');
                print('img ${img[selectedIndex]}');

                if(folder[selectedIndex]=='ไพ่ชุดใหญ่'){
                  Navigator.push(
                    context,
                    MaterialPageRoute(builder: (context) => tarotCard(position: number[0]-1)),
                  );
                }else if(folder[selectedIndex]=='ไพ่ถ้วย'){
                  Navigator.push(
                    context,
                    MaterialPageRoute(builder: (context) => cardCup(position: number[2]-1)),
                  );
                }else if(folder[selectedIndex]=='ไพ่เหรียญ'){
                  Navigator.push(
                    context,
                    MaterialPageRoute(builder: (context) => cardCoin(position: number[3]-1)),
                  );
                }else if(folder[selectedIndex]=='ไพ่ดาบ'){
                  Navigator.push(
                    context,
                    MaterialPageRoute(builder: (context) => cardSword(position: number[1]-1)),
                  );
                }else if(folder[selectedIndex]=='ไพ่ไม้'){
                  Navigator.push(
                    context,
                    MaterialPageRoute(builder: (context) => tarotsWood(position: number[4]-1)),
                  );
                }

                },
              shape: RoundedRectangleBorder(
                borderRadius: BorderRadius.circular(80.0),
                side: BorderSide(
                  color: Colors.black.withOpacity(0.9),
                  width:3.5,
                ),
              ),
              padding: EdgeInsets.all(0.0),
              child: Ink(
                decoration: BoxDecoration(
                    gradient: LinearGradient(
                      colors: [
                        Colors.orangeAccent,Colors.orangeAccent,
                      ],
                      begin: Alignment.centerLeft,
                      end: Alignment.centerRight,
                    ),
                    borderRadius: BorderRadius.circular(30.0)
                ),
                child: Container(
                  constraints:
                  BoxConstraints(maxWidth: 85.0, minHeight: 30.0),
                  alignment: Alignment.center,
                  child: Text(
                    "เปิดไพ่",
                    textAlign: TextAlign.center,
                    style: TextStyle(color: Colors.white, fontSize: 15),
                  ),
                ),
              ),
            ),
          ),*/
      ],
      ),
    );
  }
}