import '../../model/cardTarotsSword.dart';
import '../../model/cardTarotsWood.dart';



final List<cardTarotsSword> cardsSword = [
  cardTarotsSword(
    meaning:
    'หมายถึงความชัดเจน ชัดแจ้ง การตัดสินใจที่เด็ดขาด ตัดสิ่งที่มัวหมองออกไป เหมือนถึงเวลาแล้วที่คุณจะเริ่มต้นทำอะไรที่ถูกต้องตามหลักเหตุผล ไพ่ใบนี้ความหมายดีไม่ดี ก็แล้วแต่มุมมอง บางทีก็อาจทำให้คุณรู้สึกแย่ทางอารมณ์ แต่การตัดสินใจเลือกทางที่ถูกตามหลักเหตุผลย่อมดีกว่าอยู่แล้วครับ ไพ่ใบนี้ยังพูดถึงการเริ่มติดต่อพูดคุยเพื่อเคลียร์สิ่งที่คับข้องใจให้ชัดเจนขึ้น',
    love:
    'ในด้านความรัก ใบนี้ค่อนข้างจะดีทีเดียว หมายถึงการเริ่มต้นใหม่ ความรู้สึกใหม่ๆ ที่ทำให้เรารู้สึกดี หากถามว่าอีกฝ่ายรู้สึกยังไงแล้วไพ่ใบนี้แทนเค้า หรือไพ่ใบนี้ขึ้นแทนตัวเราในสถานการณ์ก็หมายถึงอารมณ์ที่รุนแรง เต็มไปด้วยพลัง ความชอบ ความรัก ที่พร้อมจะพุ่งชน พุ่งจีบ ทีเดียว  ',
    image: '1.png',
    name: 'ACE OF SWORDS',
  ),
  cardTarotsSword(
    meaning:
    'หมายถึงความชัดเจน ชัดแจ้ง การตัดสินใจที่เด็ดขาด ตัดสิ่งที่มัวหมองออกไป เหมือนถึงเวลาแล้วที่คุณจะเริ่มต้นทำอะไรที่ถูกต้องตามหลักเหตุผล ไพ่ใบนี้ความหมายดีไม่ดี ก็แล้วแต่มุมมอง บางทีก็อาจทำให้คุณรู้สึกแย่ทางอารมณ์ แต่การตัดสินใจเลือกทางที่ถูกตามหลักเหตุผลย่อมดีกว่าอยู่แล้วครับ ไพ่ใบนี้ยังพูดถึงการเริ่มติดต่อพูดคุยเพื่อเคลียร์สิ่งที่คับข้องใจให้ชัดเจนขึ้น',
    love:
    'ในด้านความรัก ใบนี้ค่อนข้างจะดีทีเดียว หมายถึงการเริ่มต้นใหม่ ความรู้สึกใหม่ๆ ที่ทำให้เรารู้สึกดี หากถามว่าอีกฝ่ายรู้สึกยังไงแล้วไพ่ใบนี้แทนเค้า หรือไพ่ใบนี้ขึ้นแทนตัวเราในสถานการณ์ก็หมายถึงอารมณ์ที่รุนแรง เต็มไปด้วยพลัง ความชอบ ความรัก ที่พร้อมจะพุ่งชน พุ่งจีบ ทีเดียว  ',
    image: '2.png',
    name: 'ACE OF SWORDS',
  ),


];