import 'package:flutter/material.dart';
import 'package:final_project/model/siemsees.dart';
import 'dart:math';
class siemsee extends StatefulWidget {
  const siemsee({Key? key}) : super(key: key);

  @override
  _siemseeState createState() => _siemseeState();
}

class _siemseeState extends State<siemsee> {
  int _num = 0;
  final List<siemsees> cards = [
    siemsees(
        work:
            'คุณก๋าลังคิดอยากหาช่องทางทํามาหากินใหม่ๆแต่ดูเหมือนว่ายังเจอทางตัน คืออยากทำอยากลองแต่แค่ไม่รู้ว่าจะเริ่มและเดินต่ออย่างไรหรือทางไหน ',
        money:
            'อยากจะได้สิ่งของที่เล็งมานาน คาดหวังว่าต้องได้สักทีแล้วล่ะ แต่ดูเหมือนว่าเงินในบัญชีหรือในกระเป๋าของคุณก็ยังมีไม่เพียงพอ',
        love:
            'คนโสดมีคนเข้ามาคุยเยอะ แต่ก็แค่นั้น ได้แค่คุย คุณยังไม่ได้คิดจริงจังกับใครหรือเค้าก็ยังไม่ได้คิดจริงจังกับคุณเช่นเดียวกัน\nคนมีคู่เป็นช่วงเวลาที่คุณโหยหากันมาก ที่สุด เหมือนเพิ่งผ่านการทะเลาะหรือการห่างกันเลยทําให้มีแรงดึงดูดเข้าหากันมากกว่าเดิม',
        health: 'ระวังปวดเมื่อยกล้ามเนื้อ โดย เฉพาะปวดขา เข่า และแขน'),
    siemsees(
        work:
            'คุณเหมือนทำงานอยู่คนเดียวเมื่อตำแหน่งยิ่งสูงก็ยิ่งทำให้คุณต้องรับผิดชอบงานที่เยอะและยากขึ้น หลายๆครั้งเลยรู้สึกเหมือนไม่มีใครเข้าใจ',
        money:
            'คุณมีเกณฑ์ได้โชคลาภ หรือเงินก้อน หรือเงินที่คุณคาดหวังเอาไว้ โดยมีโอกาสจะได้ในจำนวนที่หวังไว้',
        love:
            'คนโสด จะมีคนเข้ามาสนใจคุณ แถมเข้ามาทางเพื่อนของคุณด้วย ให้เพื่อนของคุณช่วยเพิ่มโอกาสการใกล้ชิด\nคนมีคู่ คุณเริ่มเหนื่อยกับความสัมพันธ์กับคนรักขึ้นทุกวัน ดูเหมือนว่ายิ่งวิ่งไล่ตามเขามากเท่าไร ความสัมพันธ์ก็ยิ่งห่างกันไปทุกที',
        health: 'ระวังปวดหัวเข่า ขาแพลง ขาพลิก ปวดเมื่อยตามร่างกาย'),
    siemsees(
        work:
        'ค่อนข้างไปได้เรื่อย ไม่ได้มีปัญหาเรื่องงานหรือบริวารอะไรมากนัก แนวๆว่าที่เคยทําเป็นประจําแบบไหนก็ยังคงทําในลักษณะนั้นต่อไปได้ผลงานน่าพอใจ',
        money:
        'พอมีเก็บหอมรอมริบอยู่บ้าง แต่ ก็ไม่ได้มากมายเท่าไรนัก ข้อดีคือคุณไม่หยุดที่จะพยายามประหยัดให้ได้มากที่สุด ',
        love:
        'คนโสด อยู่แต่กับเพื่อนหรือครอบครัวไปก่อน ไม่ต้องไปคิดถึงการมีคู่เลยในช่วงนี้ เพราะว่าเนื้อคู่ยังมาไม่ถึง\nคนมีคู่ โชคดีที่คุณกับคนรักต่างก็มีเป้าหมายเดียวกัน คือการสร้างครอบครัว แม้อาจมีเวลาให้กันไม่มากนักแต่ความสัมพันธ์ก็ยังเป็นไปในทางที่ดี',
        health: 'ระวังเป็นหวัด ภูมิแพ้ ร้อนใน'),
    siemsees(
        work:
        'มีเกณฑ์ได้รับมอบหมายงานดีๆ เพิ่มเติมหรือได้เปลี่ยนตำแหน่งหน้าที่ที่ดีขึ้น ได้เลื่อนขั้น',
        money:
        'จะมีคนเข้ามาช่วยเหลือคุณในด้านการเงิน หรือคุณอาจจําเป็นต้องเข้าไปช่วยเหลือเรื่องเงินๆ ทองๆ ให้คนอื่น',
        love:
        'คนโสด ยังคงโสดต่อไป แต่คุณก็ไม่ได้ทุกข์ร้อนอะไรออกจะมีความสุขเสียอีก อยู่คนเดียวได้สบายๆ\nคนมีคู่ คนรักให้ของขวัญหรือของมีค่ากับคุณเพราะคุณทำตัวดีและน่ารักใจฟูกันเลยทีเดียว',
        health: 'ระวังเป็นโรคผิวหนัง เช่น สิว ผิว อักเสบ ผื่นแพ้'),
    siemsees(
        work:
        'เป็นช่วงเรื่อยๆไม่มีอะไรหวือหวา เคยทําอย่างไรก็ทําแบบนั้น เป้าหมายยังไม่ชัด ยังไม่มีงานเสริมเพิ่มเติม ',
        money:
        'หัวหมุนเรื่องการเงินไปหมด มีแต่ค่าใช้จ่ายเข้ามาต่างๆ นานา ยังเก็บเงิน ไม่อยู่ ',
        love:
        'คนโสด จะมีคนเข้ามาขอบคุณ แถมดูเหมือนว่าคุณจะชอบเขาอีกด้วย มีโอกาสสานต่อกันได้\nคนมีคู่ ระวังคนอื่นนำจะปัญหาความรักมาให้ หรืออาจมีปัญหากันเพราะเรื่องของคนอื่น ปวดหัวน่าดู ',
        health: 'ระวังปวดตรงช่องท้อง ลำไส้อักเสบ'),
    siemsees(
        work:
        'คนอื่นทิ้งปัญหาเรื่องงานไว้ให้กับคุณ คุณต้องคอยแก้ปัญหาให้เขาและรู้สึกเหนื่อยใจค่อนข้างมาก ',
        money:
        'เหนื่อยมากกับการหาเงิน เหมือนรายจ่ายที่มีค่อนข้างเยอะจนรัดตัวทําให้ยิ่งต้องหาเงินเพิ่มขึ้นอีก ',
        love:
        'คนโสด คุณยังคงคิดถึงคนเก่าๆและยังคงแอบส่องเขา อยากรู้ความเป็นไปของเขาทั้งๆที่เขาไม่ได้สนใจคุณเลย\nคนมีคู่ คุณกับคนรักพากันไปทำบุญ เหมือนเป็นช่วงที่เจอเรื่องราวต่างๆมากมาย เลยพากันไปแก้เคล็ดเสริมดวง ',
        health: 'ระวังดื่มน้ำน้อยเกินไป ร้อนใน'),
    siemsees(
        work:
        'เป็นช่วงที่คุณพยายามไม่สนใจปัญหา เพราะกำลังโฟกัสที่งานของคุณและทำมันให้เต็มที่เพื่อให้ผลงานออกมาดีที่สุด ',
        money:
        'ภาระหนี้สินรัดตัวมาก เรียกว่าหาเงินเท่าไรก็ไม่พอใช้ มีแต่รายจ่ายรอบด้านจนคุณก๋าลังจะแบกไม่ไหวแล้ว ',
        love:
        'คนโสด โสดแบบไม่เต็มใจสักเท่าไรเพราะคุณก็ไม่รู้ว่าทําผิดอะไรเขาถึงทิ้งคุณไป เป็นช่วงหัวใจอ่อนแอ\nคนมีคู่ คนรักทําผิดพลาดซ้ำแล้วซ้ำเล่า มีแต่ปัญหาเข้ามาในชีวิตคู่ คุณจึงเริ่มอยากที่จะถอยออกมาจากความสัมพันธ์นี้แล้ว',
        health: 'ระวังปวดแขน ปวดหัวไหล่จากการยกของหนักหรือหักโหมทำอะไรหนักๆ'),
    siemsees(
        work:
        'ค่อนข้างยุ่งเหยิงวุ่นวายอยู่พอสมควร เหมือนกับว่างานที่คุณรับผิดชอบนั้นเป็นงานที่คนอื่นพยายามเลี่ยงหรือผลักภาระมาให้',
        money:
        'มีเกณฑ์ได้โชคลาภ แถมอาจเป็นโชคลาภก้อนใหญ่อีกด้วย',
        love:
        'คนโสด คุณพยายามติดต่อเขา แต่ดูเหมือนว่าเขาจะตัดช่องทางการติดต่อคุณในทุกๆทางจนคุณหงุดหงิดใจ\nคนมีคู่ ต่างคนต่างไม่ค่อยสนใจกันเท่าที่ควรเลยทําให้มีความห่างเหินกันเกิดขึ้น ',
        health: 'ระวังภูมิแพ้ เป็นหวัด'),
    siemsees(
        work:
        'เป็นช่วงที่ต้องเคลียร์งานสําคัญๆออกไปก่อนไม่เช่นนั้นจะเกิดปัญหาโดยที่ผ่านมางานค่อนข้างยุ่งเหยิงวุ่นวายอยู่พอสมควร',
        money:
        'คุณเครียดกับการเงินค่อนข้างมาก แถมแบกรับภาระต่างๆไว้เพียงคนเดียว ไม่มีใครช่วยเหลือคุณได้ ',
        love:
        'คนโสด รู้สึกคิดถูกแล้วที่เลิกกับคนรักเก่าไป เพราะตอนนี้มีคนใหม่ที่ดีกว่าเข้ามาหาคุณให้ชุ่มชื่นหัวใจ\nคนมีคู่ คนรักค่อนข้างเกรงกลัวคุณอยู่พอสมควร และดูเหมือนว่าคุณก็แอบกดดันเค้าอยู่บ่อยๆอีกด้วย ',
        health: 'ระวังปวดหลัง ปวดสะโพกจากการนั่งนานหรือขยับร่างกายน้อยไปหน่อย'),
    siemsees(
        work:
        'ช่วงนี้มีผู้ใหญ่กำลังเพ่งเล็งคุณอยู่ และคุณก็รู้สึกอึดอัดใจอยู่เหมือนกัน ถึงคราวจะต้องหาทางอธิบายหรือปรับตัวให้สถานการณ์ดีขึ้น ',
        money:
        'มีเกณฑ์ที่จะได้เงินที่คุณคาดหวังไว้ หรือหากคุณทําการค้า ยอดหรือเป้าที่หวังไว้ก็มีโอกาสเป็นไปได้สูง ขอแค่พยายามอย่าท้อ ',
        love:
        'คนโสด ยังคงโสดอยู่ ไม่มีใครเข้ามา หรือมีคนเข้ามาแต่ก็ไม่ถูกใจ คุณเลยแอบรู้สึกเหงาๆอยู่เหมือนกัน\nคนมีคู่ คนรักพยายามทําตัวน่ารักให้คุณ ให้อภัยเขาในสิ่งที่เขาทําผิดพลาดไป เขาสำนึกผิดแล้วและพยายามปรับปรุงตัว ',
        health: 'ระวังอาการนอนไม่หลับ นอนไม่เพียงพอ หรือปัญหาการนอนหลับอื่นๆ'),
    siemsees(
        work:
        'ต้องมีการแก้ไขงานหรือปรับเปลี่ยนรูปแบบการทำงานที่แตกต่างออกไปจากเดิมพอสมควร แนวโน้มเป็นไปในทางที่ดี',
        money:
        'เป็นช่วงที่ร้อนเงินมาก เหมือนเงินเข้ามาแล้วเก็บไม่อยู่ ต้องมีเรื่องให้ใช้จ่ายอยู่ตลอดเวลา',
        love:
        'คนโสด คุณพอใจที่จะอยู่คนเดียวในช่วงนี้ เพราะรู้สึกว่าถ้ามีแล้วไม่ดี ก็อย่ามีเสียดีกว่า\nคนมีคู่ ระวังมีปัญหาเรื่องมือที่สามหรือมีคนพยายามที่จะทำลายความสัมพันธ์ คุณกับคนรักต้องประคับประคองความรักกันให้ดี ',
        health: 'ระวังหกล้ม เป็นแผล เจ็บเข่า'),
    siemsees(
        work:
        'มีคนมายื่นข้อเสนอเรื่องงานให้กับคุณ แต่ว่าคุณยังไม่สนใจนัก หรือขอคิดดูก่อนเพราะยังไม่มั่นใจ',
        money:
        'มีเกณฑ์จะได้เงินเข้ามาพอสมควร หรือเป็นช่วงที่คุณสามารถที่จะกอบโกยเงินได้พอตัวเลยแหละ',
        love:
        'คนโสด คุณไม่อยากมีความรักสไตล์น้ำเน่าแบบเดิมอีกแล้ว คุณเลยยังไม่เปิดรับใครเข้ามาถ้าคิดว่ายังไม่รู้จักคนๆนั้นดี\nคนมีคู่ คนรักปล่อยให้คุณอยู่คนเดียวบ่อยๆโดยที่ไม่ได้สนใจใยดีสักเท่าไรจนคุณรู้สึกเหมือนถูกทอดทิ้ง',
        health: 'ระวังปวดฟัน ฟันผุ มีกลิ่นปาก'),
    siemsees(
        work:
        'คุณเริ่มคิดแล้วว่าจะอยู่ทำงานที่นี่ต่อหรือว่าหางานใหม่ทำดีกว่า เพราะเหมือนว่าที่ที่ทำอยู่นี้ค่อนข้างเติบโตยาก',
        money:
        'เหมือนเป็นช่วงที่คุณคิดเรื่องของการใช้เงินอยู่ตลอดเวลา อันนั้นก็อยากได้ อันนี้ก็อยากซื้อ',
        love:
        'คนโสด คนรักเก่ายังนำปัญหามาให้คุณอยู่ คุณพยายามที่จะเลี่ยงหรือตัดเขาออกไป แต่เขาก็ยังคอยมาตามวอแวอยู่ตลอด\nคนมีคู่ เหมือนอยู่ด้วยกันมานานหรือคบกันมาสักพักใหญ่ ความสัมพันธ์จึงเรื่อยๆไม่ได้หวือหวาอะไร ควรหาสิ่งใหม่ๆทำด้วยกันบ้าง',
        health: 'ระวังปวดเมื่อยแขนและขาเป็นพิเศษ'),
    siemsees(
        work:
        'ระวังการมีปัญหากับเจ้านายเพื่อนร่วมงานหรือหุ้นส่วนให้มากๆ แถมปัญหานี้เกิดมาจากตัวคุณเองอีกด้วย',
        money:
        'คุณมีหนี้ก้อนใหญ่ที่ต้องจัดการแต่ดูเหมือนว่าจะรับผิดชอบคนเดียวไม่ไหวต้องมีคนช่วยเหลือ อาจเป็นคนรักหรือคนในครอบครัว',
        love:
        'คนโสด คุณวุ่นกับเรื่องงาน เงิน เรื่องส่วนตัวอื่นๆ จนไม่มีเวลาไปโฟกัสถึงเรื่องความรักเลย\nคนมีคู่ มีโอกาสจะมีปัญหาทะเลาะเบาะแว้งเพราะความไม่เข้าใจกัน ไม่เปิดใจคุยกันตรงๆ จึงเคลียร์กันไม่ลงตัว',
        health: 'ระวังปวดข้อมือ ปวดแขนเป็นพิเศษ'),
    siemsees(
        work:
        'เหมือนคุณทำงานหลายอย่างในเวลาเดียวกันเลยทำให้ทำได้ไม่ดีสักอย่างหรือว่าไม่เสร็จสักอย่างตั้งสมาธิดีๆหน่อย',
        money:
        'มีเกณฑ์เสียเงินไปกับงานที่ไม่เป็นมงคล เช่น งานศพ หรืออาจเสียเงินไปกับการเจ็บป่วยของคนในครอบครัว',
        love:
        'คนโสด คุณยังลืมคนรักเก่าไม่ได้ ยังคงนึกถึงเขาแต่ก็ไม่กล้าติดต่อเขาไปปล่อยตัวเองจมกับความเศร้าใจ\nคนมีคู่ คุณค่อนข้างกดดันคนรักเหมือนอยากให้ทำอะไรตามที่คุณร้องขอหรือต้องการ จนเขาไม่พอใจหรืออึดอัด',
        health: 'ระวังอุบัติเหตุเล็กๆน้อยๆ เช่น มีดบาด หกล้มเป็นแผล น้ำร้อนลวก'),
    siemsees(
        work:
        'งานทั้งหลายทั้งปวงมาตกอยู่ที่คุณเพียงคนเดียว แม้จะมีเพื่อนร่วมงานหลายคนแต่ต่างก็เน้นเอาตัวรอด หันพึ่งใครไม่ได้',
        money:
        'มีเกณฑ์จ่ายเงินไปกับเรื่องการเดินทาง หรือเกี่ยวกับยานพาหนะ เช่น รถชน รถเสีย รถซ่อม',
        love:
        'คนโสด คุณไม่กังวลใจกับความโสดสักเท่าไรเพราะคิดว่าเดี๋ยวไม่นานก็มีคนเข้ามาหาคุณอย่างแน่นอน\nคนมีคู่ คุณกับคนรักมักมีปัญหากันในเรื่องเงินๆทองๆ ซึ่งอาจเป็นปัญหาที่บานปลายลุกลามจนไม่เข้าใจกัน',
        health: 'ระวังสายตามีปัญหา ปวดตา เจ็บ ตา'),
    siemsees(
        work:
        'รู้สึกไม่โอเคเลยที่งานของคุณเกิดปัญหาเพราะเพื่อนร่วมงาน เหมือนว่าหาทางเจอกันตรงกลางไมได้ จึงมีเกณฑ์ที่จะทะเลาะกันหรือบานปลายเกินไปได้',
        money:
        'คุณมีเกณฑ์ได้เงินก้อนหรือลาภลอย แต่เป็นทุกขลาภ คือได้เงินมาแล้วแต่ก็มีเหตุให้เสียไปโดยไม่ทันตั้งตัว',
        love:
        'คนโสด มีเกณฑ์ที่จะได้เจอคนที่ถูกใจและค่อนข้างเข้ากับคุณได้ดีมากในหลายๆ ด้าน\nคนมีคู่ พยายามอย่าขุดคุ้ยเรื่องเก่าๆ ในอดีตมาถกกัน เพราะจะยิ่งทำให้เกิดปัญหาที่ไม่จบไม่สิ้น โฟกัสกับปัจจุบันจะดีที่สุด',
        health: 'ระวังปัญหาสายตา เช่น ปวดกระบอกตา ตาพร่ามัวง่าย'),
    siemsees(
        work:
        'คุณจะได้รับมอบหมายงานใหม่ๆเข้ามาซึ่งเป็นงานที่คุณถนัดและชอบ หรืออาจจะได้งานที่คุณดีลไว้ก่อนนี้อีกด้วย',
        money:
        'ค่าใช้จ่ายมาทุกระดับ มารอบด้าน จนแทบไม่เหลือเงินเก็บ ',
        love:
        'คนโสด คุณยังคงร้องไห้เสียใจกับความรักที่ผ่านพ้นไปและไม่มีวันย้อนกลับมาอีกพยายามทำใจเริ่มต้นใหม่แต่ก็ยังคงยากอยู่\nคนมีคู่ เพราะความมีอีโก้เลยทำให้ยอมกันไม่เป็น ไม่มีใครยอมใครเลยจนทำให้ความสัมพันธ์ของคุณเหมือนจะถึงทางตัน',
        health: 'ระวังปวดเมื่อยตามตัว ครั่นเนื้อครั่นตัวราวกับจะเป็นไข้'),
    siemsees(
        work:
        'ช่วงนี้เหมือนคุณยังไม่อยากที่จะรับรู้เรื่องงานใดๆ เพิ่มเติม อยากเคลียร์หรือสะสางงานที่ทำอยู่ให้เสร็จไปทีละอย่างก่อน',
        money:
        'มีเกณฑ์จะได้เงินหรือของมีค่าจากคนรัก รวมถึงอาจจะได้เงินจากลูกค้าที่เคยดีลกันหรือติดต่อกันไว้ก่อนนี้',
        love:
        'คนโสด จะมีคนเข้ามาชอบคุณ แต่คุณรู้สึกว่ายังไม่ถูกใจ ไม่ชอบสักเท่าไรเพราะรู้สึกเหมือนเขามีทัศนคติแปลกๆไม่น่าไปกันได้\nคนมีคู่ เป็นช่วงที่ดีในเรื่องความสัมพันธ์คุณค่อนข้างเข้าใจเขาและเขาก็เข้าใจคุณ',
        health: 'ระวังอาการแน่นหน้าอก หายใจไม่ออก จุกเสียดแบบไม่มีสาเหตุ'),
    siemsees(
        work:
        'ค่อนข้างมีอุปสรรคหรือข้อติดขัดในเรื่องหน้าที่การงาน และดูเหมือนว่าคุณจะจัดการกับมันได้ไม่ดีเท่าที่ควร ระวังจะบานปลายจนสร้างความเดือดร้อนให้ตนเอง',
        money:
        'มีเกณฑ์ใช้จ่ายไปกับข้าวของเครื่องใช้ทั้งจำเป็นและฟุ่มเฟือย โดยเฉพาะเครื่องมือสื่อสาร เช่น โทรศัพท์ คอมพิวเตอร์ นาฬิกา',
        love:
        'คนโสด คุณมีแต่เพื่อนๆ รายล้อมอยู่ จึงทำให้ไม่ค่อยมีคนกล้าที่จะเข้ามาเปิดเผยความรู้สึกที่แท้จริงต่อคุณ\nคนมีคู่ ระวังมีปัญหาเลิกรา แยกทางกันเพราะเรื่องในครอบครัวหรือเรื่องคนอื่นเป็นเหตุ หากแก้ไขได้ตั้งแต่เนิ่นๆ ควรรีบทำ',
        health: 'ระวังปวดขา ปวดเข่า ข้อเท้า'),
  ];


  @override
  Widget build(BuildContext context) {
    Random random = new Random();
    int randomNumber = random.nextInt(cards.length);


    return Scaffold(
      appBar: AppBar(
        title: Text(''),
        backgroundColor: Colors.orangeAccent,
      ),
      body: Stack(
        children: [
          Container(
            decoration: BoxDecoration(
              image: DecorationImage(
                image: AssetImage("assets/images/bg/prm2.jpg"),
                fit: BoxFit.cover,
              ),
            ),
          ),
          Center(
            child: Container(
              height: 600,
              width: 1000,
              child: Padding(
                padding: const EdgeInsets.all(10),
                child: Card(
                  shape: RoundedRectangleBorder(
                    borderRadius: BorderRadius.circular(15), // if you need this
                    side: BorderSide(
                      color: Colors.black.withOpacity(0.9),
                      width:4,
                    ),

                  ),
                  child: Column(
                    children: [
                      ListTile(
                        title: Text("ใบที่ ${randomNumber+1}",style: TextStyle(fontWeight: FontWeight.bold, fontSize: 16,color: Colors.black), textAlign: TextAlign.center),
                        /*subtitle: Text('ดวงอะไรวะ'),*/
                      ),
                      Text('การงาน', style: TextStyle(fontWeight: FontWeight.bold,fontSize: 13,color: Colors.black),),
                      Padding(
                        padding: const EdgeInsets.only(left: 20.0, right: 20.0,bottom: 5.0),
                        child: Text(cards[randomNumber].work, textAlign: TextAlign.start , style: TextStyle(fontSize: 13,color: Colors.black),),
                      ),
                      Text('การเงิน', style: TextStyle(fontWeight: FontWeight.bold,fontSize: 13,color: Colors.black),),
                      Padding(
                        padding: const EdgeInsets.only(left: 20.0, right: 20.0,bottom: 5.0),
                        child: Text(cards[randomNumber].money, textAlign: TextAlign.start, style: TextStyle(fontSize: 13,color: Colors.black),),
                      ),
                      Text('ความรัก', style: TextStyle(fontWeight: FontWeight.bold,fontSize: 13,color: Colors.black),),
                      Padding(
                        padding: const EdgeInsets.only(left: 20.0, right: 20.0,bottom: 5.0),
                        child: Text(cards[randomNumber].love, textAlign: TextAlign.start, style: TextStyle(fontSize: 13,color: Colors.black),),
                      ),
                      Text('สุขภาพ', style: TextStyle(fontWeight: FontWeight.bold,fontSize: 13,color: Colors.black),),
                      Padding(
                        padding: const EdgeInsets.only(left: 20.0, right: 20.0),
                        child: Text(cards[randomNumber].health, textAlign: TextAlign.start, style: TextStyle(fontSize: 13,color: Colors.black),),
                      ),
                     /* Align(
                        alignment: Alignment.bottomLeft,
                        child: Padding(
                          padding: const EdgeInsets.all(8.0),
                          child: ElevatedButton.icon(
                            onPressed: () => _handleClickButton(-1),
                            label: const Padding(
                              padding: EdgeInsets.all(12.0),
                              child: Text('ก่อนหน้า'),
                            ),
                            icon: const Icon(
                              Icons.keyboard_arrow_left,
                              color: Colors.white,
                            ),
                          ),
                        ),
                      ),
                      Align(
                        alignment: Alignment.bottomRight,
                        child: Padding(
                          padding: const EdgeInsets.all(8.0),
                          child: Directionality(
                            textDirection: TextDirection.rtl,
                            child: ElevatedButton.icon(
                              onPressed: () => _handleClickButton(1),
                              label: const Padding(
                                padding: EdgeInsets.all(12.0),
                                child: Text('ถัดไป'),
                              ),
                              icon: const Icon(
                                Icons.keyboard_arrow_right,
                                color: Colors.white,
                              ),
                            ),
                          ),
                        ),
                      ),
*/
                    ],
                  ),
                  elevation: 8,
                  shadowColor: Colors.indigo,
                  margin: EdgeInsets.all(20),
                ),
              ),
            ),
          )
        ],
      ),
    );
  }
  void _handleClickButton(int value) {
    final newIndex = _num + value;
    if (newIndex < 0 || newIndex > cards.length - 1) return;

    setState(() {
      _num += value;
    });
  }
}
